newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
/**************************************************************************/
/* FILE NAME: mpc567xR_c.h                   COPYRIGHT (c) Freescale 2011 */
/* VERSION:  1.0c                                 All Rights Reserved     */
/*                                                                        */
/* DESCRIPTION:                                                           */
/* This file contains all of the register and bit field definitions for   */
/* MPC567xR with modifications and conditional definitions to support     */
/* Monaco header file version 1.6. A #define COMP_TO_MPC5634M_V1_6_ON     */
/* must be added to enable the Monaco V1.6 compatibility.                 */
/*========================================================================*/
/* UPDATE HISTORY                                                         */
/* REV     AUTHOR      DATE      DESCRIPTION OF CHANGE                    */
/* ---  -----------  ---------   ---------------------                    */
/* 0.1  R. Dees      08/Jan/2010 Split from revision 1.03 of the          */
/*                               MPC5674F.h. Added DTS module             */
/*                               Added SIU Core MMU PID Control Registers */
/* 0.2  D. Erazmus   18/Jun/2010 Merged updates from revision 1.08 of     */
/*                               MPC5674f.h.                              */
/* 0.3  D. Erazmus   02/Nov/2010 Merged updates from revision 1.09 of     */
/*                               MPC5674f.h                               */
/*                               - Added FlexCAN RXFIFO structure.	      */
/*                               - Added CLKCFG_DIS field to ESYNCR2      */
/* 0.4  D. Erazmus   09/Dec/2010 Initial complete MPC567xR header file.   */
/* 0.5  D. Erazmus   03/Mar/2011 Updated Flexray ECC and buffer regs.     */
/* 0.6  D. Erazmus   24/Mar/2011 Added EDMA GWRH/GWRL                     */
/* 0.7  D. Erazmus   31/Mar/2011 Reversed bit-field order in SIU.DECFIL   */
/*                               registers due to reference manual errata.*/
/* 0.8  D. Erazmus   05/Apr/2011 Fixed BIUCR3 M1PFE field. Removed M0PFE. */
/* 0.8c D. Erazmus   05/Apr/2011 Added MPC5634M compatibility with #define*/
/*                               Branches from standard MPC5676R header   */
/*                               file starting at rev 0.8.                */
/* 0.9c D. Erazmus   26/May/2011 Added missing fields to MPU RGD and      */
/*                               RDGAAC registers.                        */
/* 1.0c D. Erazmus   18/Jul/2011 Fixed ETPU_DATA_RAM_END.  It is 6k total */
/*                               for ETPUA and ETPUB (3k per engine).     */
/*                               Fixed definition of flash registers HLR  */
/*                               and HSR.  HBLOCK and HBSEL fields are 10 */
/*                               bits wide for MPC5676R.                  */                                  
/**************************************************************************/

#ifndef _MPC567xR_H_
#define _MPC567xR_H_

#include "../util/typedefs.h"
#include "s32_core_e200.h"
#ifdef  __cplusplus
extern "C" {
#endif

#ifdef __MWERKS__
#pragma push
#pragma ANSI_strict off
#endif

/* ----------------------------------------------------------------------------
   -- Generic macros
   ---------------------------------------------------------------------------- */

/* IO definitions (access restrictions to peripheral registers) */
/**
*   IO Type Qualifiers are used
*   \li to specify the access to peripheral variables.
*   \li for automatic generation of peripheral register debug information.
*/
#ifndef __IO
#ifdef __cplusplus
  #define   __I     volatile             /*!< Defines 'read only' permissions                 */
#else
  #define   __I     volatile const       /*!< Defines 'read only' permissions                 */
#endif
#define     __O     volatile             /*!< Defines 'write only' permissions                */
#define     __IO    volatile             /*!< Defines 'read / write' permissions              */
#endif


#define MPC5676R_SERIES

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers for MPC5777C
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers_MPC5777C Interrupt vector numbers for MPC5777C
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 512u               /**< Number of interrupts in the Vector table */

/**
 * @brief Defines the Interrupt Numbers definitions
 *
 * This enumeration is used to configure the interrupts.
 *
 * Implements : IRQn_Type_Class
 */
typedef enum
{
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */

  /* Device specific interrupts */
  SS0_IRQn                     = 0u,               /**< Software setable flag 0 SSCIR0[CLR0] */
  SS1_IRQn                     = 1u,               /**< Software setable flag 1 SSCIR0[CLR1] */
  SS2_IRQn                     = 2u,               /**< Software setable flag 2 SSCIR0[CLR2] */
  SS3_IRQn                     = 3u,               /**< Software setable flag 3 SSCIR0[CLR3] */
  SS4_IRQn                     = 4u,               /**< Software setable flag 4 SSCIR0[CLR4] */
  SS5_IRQn                     = 5u,               /**< Software setable flag 5 SSCIR0[CLR5] */
  SS6_IRQn                     = 6u,               /**< Software setable flag 6 SSCIR0[CLR6] */
  SS7_IRQn                     = 7u,               /**< Software setable flag 7 SSCIR0[CLR7] */
  SWT0_IRQn                    = 8u,               /**< Software Watchdog 0 Interrupt flag */
  FCCU_MISC_IRQn               = 9u,               /**< FCCU ALARM state entry | FCCU CONFIG state watchdog timeout */
  DMA0_ERR0_31_IRQn            = 10u,              /**< eDMA0 channel Error flags 0-31 */
  DMA0_0_IRQn                  = 11u,              /**< eDMA0 channel Interrupt 0 */
  DMA0_1_IRQn                  = 12u,              /**< eDMA0 channel Interrupt 1 */
  DMA0_2_IRQn                  = 13u,              /**< eDMA0 channel Interrupt 2 */
  DMA0_3_IRQn                  = 14u,              /**< eDMA0 channel Interrupt 3 */
  DMA0_4_IRQn                  = 15u,              /**< eDMA0 channel Interrupt 4 */
  DMA0_5_IRQn                  = 16u,              /**< eDMA0 channel Interrupt 5 */
  DMA0_6_IRQn                  = 17u,              /**< eDMA0 channel Interrupt 6 */
  DMA0_7_IRQn                  = 18u,              /**< eDMA0 channel Interrupt 7 */
  DMA0_8_IRQn                  = 19u,              /**< eDMA0 channel Interrupt 8 */
  DMA0_9_IRQn                  = 20u,              /**< eDMA0 channel Interrupt 9 */
  DMA0_10_IRQn                 = 21u,              /**< eDMA0 channel Interrupt 10 */
  DMA0_11_IRQn                 = 22u,              /**< eDMA0 channel Interrupt 11 */
  DMA0_12_IRQn                 = 23u,              /**< eDMA0 channel Interrupt 12 */
  DMA0_13_IRQn                 = 24u,              /**< eDMA0 channel Interrupt 13 */
  DMA0_14_IRQn                 = 25u,              /**< eDMA0 channel Interrupt 14 */
  DMA0_15_IRQn                 = 26u,              /**< eDMA0 channel Interrupt 15 */
  DMA0_16_IRQn                 = 27u,              /**< eDMA0 channel Interrupt 16 */
  DMA0_17_IRQn                 = 28u,              /**< eDMA0 channel Interrupt 17 */
  DMA0_18_IRQn                 = 29u,              /**< eDMA0 channel Interrupt 18 */
  DMA0_19_IRQn                 = 30u,              /**< eDMA0 channel Interrupt 19 */
  DMA0_20_IRQn                 = 31u,              /**< eDMA0 channel Interrupt 20 */
  DMA0_21_IRQn                 = 32u,              /**< eDMA0 channel Interrupt 21 */
  DMA0_22_IRQn                 = 33u,              /**< eDMA0 channel Interrupt 22 */
  DMA0_23_IRQn                 = 34u,              /**< eDMA0 channel Interrupt 23 */
  DMA0_24_IRQn                 = 35u,              /**< eDMA0 channel Interrupt 24 */
  DMA0_25_IRQn                 = 36u,              /**< eDMA0 channel Interrupt 25 */
  DMA0_26_IRQn                 = 37u,              /**< eDMA0 channel Interrupt 26 */
  DMA0_27_IRQn                 = 38u,              /**< eDMA0 channel Interrupt 27 */
  DMA0_28_IRQn                 = 39u,              /**< eDMA0 channel Interrupt 28 */
  DMA0_29_IRQn                 = 40u,              /**< eDMA0 channel Interrupt 29 */
  DMA0_30_IRQn                 = 41u,              /**< eDMA0 channel Interrupt 30 */
  DMA0_31_IRQn                 = 42u,              /**< eDMA0 channel Interrupt 31 */
  PCS_IRQn                     = 43u,              /**< Progressive Clock Switch Interrupt SIU_PCSIFR[PCSI] */
  PLL_IRQn                     = 44u,              /**< PLL Loss of Lock Flags PLL0_SR[LOLF] | PLL1_SR[LOLF] */
  SIU_OVF_IRQn                 = 45u,              /**< SIU combined overrun interrupt requests of the external interrupt Overrun Flags */
  SIU_0_IRQn                   = 46u,              /**< SIU External Interrupt Flag 0 SIU_EIISR[EIF0] */
  SIU_1_IRQn                   = 47u,              /**< SIU External Interrupt Flag 1 SIU_EIISR[EIF1] */
  SIU_2_IRQn                   = 48u,              /**< SIU External Interrupt Flag 2 SIU_EIISR[EIF2] */
  SIU_3_IRQn                   = 49u,              /**< SIU External Interrupt Flag 3 SIU_EIISR[EIF3] */
  SIU_4_15_IRQn                = 50u,              /**< SIU External Interrupt Flag 15-4 SIU_EIISR[EIF15:EIF4] */
  EMIOS0_F0_IRQn               = 51u,              /**< eMIOS_0 channel 0 Flag */
  EMIOS0_F1_IRQn               = 52u,              /**< eMIOS_0 channel 1 Flag */
  EMIOS0_F2_IRQn               = 53u,              /**< eMIOS_0 channel 2 Flag */
  EMIOS0_F3_IRQn               = 54u,              /**< eMIOS_0 channel 3 Flag */
  EMIOS0_F4_IRQn               = 55u,              /**< eMIOS_0 channel 4 Flag */
  EMIOS0_F5_IRQn               = 56u,              /**< eMIOS_0 channel 5 Flag */
  EMIOS0_F6_IRQn               = 57u,              /**< eMIOS_0 channel 6 Flag */
  EMIOS0_F7_IRQn               = 58u,              /**< eMIOS_0 channel 7 Flag */
  EMIOS1_F0_IRQn               = 59u,              /**< eMIOS_1 channel 0 Flag */
  EMIOS1_F1_IRQn               = 60u,              /**< eMIOS_1 channel 1 Flag */
  EMIOS1_F2_IRQn               = 61u,              /**< eMIOS_1 channel 2 Flag */
  EMIOS1_F3_IRQn               = 62u,              /**< eMIOS_1 channel 3 Flag */
  EMIOS1_F4_IRQn               = 63u,              /**< eMIOS_1 channel 4 Flag */
  EMIOS1_F5_IRQn               = 64u,              /**< eMIOS_1 channel 5 Flag */
  EMIOS1_F6_IRQn               = 65u,              /**< eMIOS_1 channel 6 Flag */
  EMIOS1_F7_IRQn               = 66u,              /**< eMIOS_1 channel 7 Flag */
  ETPU01_GE_IRQn               = 67u,              /**< eTPU Engine 0 and 1 Global Exception */
  ETPU0_CIS0_IRQn              = 68u,              /**< eTPU Engine 0 Channel 0 Interrupt Status */
  ETPU0_CIS1_IRQn              = 69u,              /**< eTPU Engine 0 Channel 1 Interrupt Status */
  ETPU0_CIS2_IRQn              = 70u,              /**< eTPU Engine 0 Channel 2 Interrupt Status */
  ETPU0_CIS3_IRQn              = 71u,              /**< eTPU Engine 0 Channel 3 Interrupt Status */
  ETPU0_CIS4_IRQn              = 72u,              /**< eTPU Engine 0 Channel 4 Interrupt Status */
  ETPU0_CIS5_IRQn              = 73u,              /**< eTPU Engine 0 Channel 5 Interrupt Status */
  ETPU0_CIS6_IRQn              = 74u,              /**< eTPU Engine 0 Channel 6 Interrupt Status */
  ETPU0_CIS7_IRQn              = 75u,              /**< eTPU Engine 0 Channel 7 Interrupt Status */
  ETPU0_CIS8_IRQn              = 76u,              /**< eTPU Engine 0 Channel 8 Interrupt Status */
  ETPU0_CIS9_IRQn              = 77u,              /**< eTPU Engine 0 Channel 9 Interrupt Status */
  ETPU0_CIS10_IRQn             = 78u,              /**< eTPU Engine 0 Channel 10 Interrupt Status */
  ETPU0_CIS11_IRQn             = 79u,              /**< eTPU Engine 0 Channel 11 Interrupt Status */
  ETPU0_CIS12_IRQn             = 80u,              /**< eTPU Engine 0 Channel 12 Interrupt Status */
  ETPU0_CIS13_IRQn             = 81u,              /**< eTPU Engine 0 Channel 13 Interrupt Status */
  ETPU0_CIS14_IRQn             = 82u,              /**< eTPU Engine 0 Channel 14 Interrupt Status */
  ETPU0_CIS15_IRQn             = 83u,              /**< eTPU Engine 0 Channel 15 Interrupt Status */
  ETPU0_CIS16_IRQn             = 84u,              /**< eTPU Engine 0 Channel 16 Interrupt Status */
  ETPU0_CIS17_IRQn             = 85u,              /**< eTPU Engine 0 Channel 17 Interrupt Status */
  ETPU0_CIS18_IRQn             = 86u,              /**< eTPU Engine 0 Channel 18 Interrupt Status */
  ETPU0_CIS19_IRQn             = 87u,              /**< eTPU Engine 0 Channel 19 Interrupt Status */
  ETPU0_CIS20_IRQn             = 88u,              /**< eTPU Engine 0 Channel 20 Interrupt Status */
  ETPU0_CIS21_IRQn             = 89u,              /**< eTPU Engine 0 Channel 21 Interrupt Status */
  ETPU0_CIS22_IRQn             = 90u,              /**< eTPU Engine 0 Channel 22 Interrupt Status */
  ETPU0_CIS23_IRQn             = 91u,              /**< eTPU Engine 0 Channel 23 Interrupt Status */
  ETPU0_CIS24_IRQn             = 92u,              /**< eTPU Engine 0 Channel 24 Interrupt Status */
  ETPU0_CIS25_IRQn             = 93u,              /**< eTPU Engine 0 Channel 25 Interrupt Status */
  ETPU0_CIS26_IRQn             = 94u,              /**< eTPU Engine 0 Channel 26 Interrupt Status */
  ETPU0_CIS27_IRQn             = 95u,              /**< eTPU Engine 0 Channel 27 Interrupt Status */
  ETPU0_CIS28_IRQn             = 96u,              /**< eTPU Engine 0 Channel 28 Interrupt Status */
  ETPU0_CIS29_IRQn             = 97u,              /**< eTPU Engine 0 Channel 29 Interrupt Status */
  ETPU0_CIS30_IRQn             = 98u,              /**< eTPU Engine 0 Channel 30 Interrupt Status */
  ETPU0_CIS31_IRQn             = 99u,              /**< eTPU Engine 0 Channel 31 Interrupt Status */
  EQADC0_OVRx_IRQn             = 100u,             /**< eQADC combined overrun interrupt requests from all of the FIFOs: Trigger Overrun, Receive FIFO Overflow and command FIFO Underflow */
  EQADC0_FIFO0_NCF_IRQn        = 101u,             /**< eQADC command FIFO 0 Non-Coherency Flag */
  EQADC0_FIFO0_PF_IRQn         = 102u,             /**< eQADC command FIFO 0 Pause Flag */
  EQADC0_FIFO0_EOQF_IRQn       = 103u,             /**< eQADC command FIFO 0 command queue End of Queue Flag */
  EQADC0_FIFO0_CFFF_IRQn       = 104u,             /**< eQADC Command FIFO 0 Fill Flag */
  EQADC0_FIFO0_RFDF_IRQn       = 105u,             /**< eQADC Receive FIFO 0 Drain Flag */
  EQADC0_FIFO1_NCF_IRQn        = 106u,             /**< eQADC command FIFO 1 Non-Coherency Flag */
  EQADC0_FIFO1_PF_IRQn         = 107u,             /**< eQADC command FIFO 1 Pause Flag */
  EQADC0_FIFO1_EOQF_IRQn       = 108u,             /**< eQADC command FIFO 1 command queue End of Queue Flag */
  EQADC0_FIFO1_CFFF_IRQn       = 109u,             /**< eQADC Command FIFO 1 Fill Flag */
  EQADC0_FIFO1_RFDF_IRQn       = 110u,             /**< eQADC Receive FIFO 1 Drain Flag */
  EQADC0_FIFO2_NCF_IRQn        = 111u,             /**< eQADC command FIFO 2 Non-Coherency Flag */
  EQADC0_FIFO2_PF_IRQn         = 112u,             /**< eQADC command FIFO 2 Pause Flag */
  EQADC0_FIFO2_EOQF_IRQn       = 113u,             /**< eQADC command FIFO 2 command queue End of Queue Flag */
  EQADC0_FIFO2_CFFF_IRQn       = 114u,             /**< eQADC Command FIFO 2 Fill Flag */
  EQADC0_FIFO2_RFDF_IRQn       = 115u,             /**< eQADC Receive FIFO 2 Drain Flag */
  EQADC0_FIFO3_NCF_IRQn        = 116u,             /**< eQADC command FIFO 3 Non-Coherency Flag */
  EQADC0_FIFO3_PF_IRQn         = 117u,             /**< eQADC command FIFO 3 Pause Flag */
  EQADC0_FIFO3_EOQF_IRQn       = 118u,             /**< eQADC command FIFO 3 command queue End of Queue Flag */
  EQADC0_FIFO3_CFFF_IRQn       = 119u,             /**< eQADC Command FIFO 3 Fill Flag */
  EQADC0_FIFO3_RFDF_IRQn       = 120u,             /**< eQADC Receive FIFO 3 Drain Flag */
  EQADC0_FIFO4_NCF_IRQn        = 121u,             /**< eQADC command FIFO 4 Non-Coherency Flag */
  EQADC0_FIFO4_PF_IRQn         = 122u,             /**< eQADC command FIFO 4 Pause Flag */
  EQADC0_FIFO4_EOQF_IRQn       = 123u,             /**< eQADC command FIFO 4 command queue End of Queue Flag */
  EQADC0_FIFO4_CFFF_IRQn       = 124u,             /**< eQADC Command FIFO 4 Fill Flag */
  EQADC0_FIFO4_RFDF_IRQn       = 125u,             /**< eQADC Receive FIFO 4 Drain Flag */
  EQADC0_FIFO5_NCF_IRQn        = 126u,             /**< eQADC command FIFO 5 Non-Coherency Flag */
  EQADC0_FIFO5_PF_IRQn         = 127u,             /**< eQADC command FIFO 5 Pause Flag */
  EQADC0_FIFO5_EOQF_IRQn       = 128u,             /**< eQADC command FIFO 5 command queue End of Queue Flag */
  EQADC0_FIFO5_CFFF_IRQn       = 129u,             /**< eQADC Command FIFO 5 Fill Flag */
  EQADC0_FIFO5_RFDF_IRQn       = 130u,             /**< eQADC Receive FIFO 5 Drain Flag */
  DSPI1_ERR_IRQn               = 131u,             /**< DSPI_1 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
  DSPI1_TXFIFO_EOQF_IRQn       = 132u,             /**< DSPI_1 transmit FIFO End of Queue Flag */
  DSPI1_TXFIFO_TFFF_IRQn       = 133u,             /**< DSPI_1 Transmit FIFO Fill Flag */
  DSPI1_TCF_IRQn               = 134u,             /**< DSPI_1 Transfer Complete/DSI Data Match Flag */
  DSPI1_RXFIFO_RFDF_IRQn       = 135u,             /**< DSPI_1 Receive FIFO Drain Flag */
  DSPI2_ERR_IRQn               = 136u,             /**< DSPI_2 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
  DSPI2_TXFIFO_EOQF_IRQn       = 137u,             /**< DSPI_2 transmit FIFO End of Queue Flag */
  DSPI2_TXFIFO_TFFF_IRQn       = 138u,             /**< DSPI_2 Transmit FIFO Fill Flag */
  DSPI2_TCF_IRQn               = 139u,             /**< DSPI_2 Transfer Complete/DSI Data Match Flag */
  DSPI2_RXFIFO_RFDF_IRQn       = 140u,             /**< DSPI_2 Receive FIFO Drain Flag */
  DSPI3_ERR_IRQn               = 141u,             /**< DSPI_3 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
  DSPI3_TXFIFO_EOQF_IRQn       = 142u,             /**< DSPI_3 transmit FIFO End of Queue Flag */
  DSPI3_TXFIFO_TFFF_IRQn       = 143u,             /**< DSPI_3 Transmit FIFO Fill Flag */
  DSPI3_TCF_IRQn               = 144u,             /**< DSPI_3 Transfer Complete/DSI Data Match Flag */
  DSPI3_RXFIFO_RFDF_IRQn       = 145u,             /**< DSPI_3 Receive FIFO Drain Flag */
  ESCI0_CIR_IRQn               = 146u,             /**< Combined Interrupt Requests of ESCI Module 0 */
  PCU_MASTER0_IRQn             = 147u,             /**< PCU_IR0[OIF] | PCU_IR0[EIF] */
  PCU_MASTER1_IRQn             = 148u,             /**< PCU_IR1[OIF] | PCU_IR1[EIF] */
  ESCI1_CIR_IRQn               = 149u,             /**< Combined Interrupt Requests of ESCI Module 1 */
  PSI50_SDOE_IRQn              = 150u,             /**< PSI5_0 DMA Status, New data, OverWrite, Error interrupts */
  PSI51_SDOE_IRQn              = 151u,             /**< PSI5_1 DMA Status, New data, OverWrite, Error interrupts */
  CAN0_ESR1_IRQn               = 152u,             /**< FlexCAN_0 Bus Off, Transmit Warning, Receive Warning */
  CAN0_ESR2_IRQn               = 153u,             /**< FlexCAN_0 Error, FlexCAN_0 ECC Correctable Error, FlexCAN_0 ECC Host Access Non-Correctable Error, FlexCAN_0 ECC CAN Access Non-Correctable Error */
  CAN0_BUF0_IRQn               = 155u,             /**< FlexCAN_0 Buffer 0 Interrupt */
  CAN0_BUF1_IRQn               = 156u,             /**< FlexCAN_0 Buffer 1 Interrupt */
  CAN0_BUF2_IRQn               = 157u,             /**< FlexCAN_0 Buffer 2 Interrupt */
  CAN0_BUF3_IRQn               = 158u,             /**< FlexCAN_0 Buffer 3 Interrupt */
  CAN0_BUF4_IRQn               = 159u,             /**< FlexCAN_0 Buffer 4 Interrupt */
  CAN0_BUF5_IRQn               = 160u,             /**< FlexCAN_0 Buffer 5 Interrupt */
  CAN0_BUF6_IRQn               = 161u,             /**< FlexCAN_0 Buffer 6 Interrupt */
  CAN0_BUF7_IRQn               = 162u,             /**< FlexCAN_0 Buffer 7 Interrupt */
  CAN0_BUF8_IRQn               = 163u,             /**< FlexCAN_0 Buffer 8 Interrupt */
  CAN0_BUF9_IRQn               = 164u,             /**< FlexCAN_0 Buffer 9 Interrupt */
  CAN0_BUF10_IRQn              = 165u,             /**< FlexCAN_0 Buffer 10 Interrupt */
  CAN0_BUF11_IRQn              = 166u,             /**< FlexCAN_0 Buffer 11 Interrupt */
  CAN0_BUF12_IRQn              = 167u,             /**< FlexCAN_0 Buffer 12 Interrupt */
  CAN0_BUF13_IRQn              = 168u,             /**< FlexCAN_0 Buffer 13 Interrupt */
  CAN0_BUF14_IRQn              = 169u,             /**< FlexCAN_0 Buffer 14 Interrupt */
  CAN0_BUF15_IRQn              = 170u,             /**< FlexCAN_0 Buffer 15 Interrupt */
  CAN0_BUF16_31_IRQn           = 171u,             /**< FlexCAN_0 Buffers 31-16 Interrupts */
  CAN0_BUF32_63_IRQn           = 172u,             /**< FlexCAN_0 Buffers 63-32 Interrupts */
  CAN2_ESR1_IRQn               = 173u,             /**< FlexCAN_2 Bus Off, Transmit Warning, Receive Warning */
  CAN2_ESR2_IRQn               = 174u,             /**< FlexCAN_2 Error, FlexCAN_2 ECC Correctable Error, FlexCAN_2 ECC Host Access Non-Correctable Error, FlexCAN_2 ECC CAN Access Non-Correctable Error */
  CAN2_BUF0_IRQn               = 176u,             /**< FlexCAN_2 Buffer 0 Interrupt */
  CAN2_BUF1_IRQn               = 177u,             /**< FlexCAN_2 Buffer 1 Interrupt */
  CAN2_BUF2_IRQn               = 178u,             /**< FlexCAN_2 Buffer 2 Interrupt */
  CAN2_BUF3_IRQn               = 179u,             /**< FlexCAN_2 Buffer 3 Interrupt */
  CAN2_BUF4_IRQn               = 180u,             /**< FlexCAN_2 Buffer 4 Interrupt */
  CAN2_BUF5_IRQn               = 181u,             /**< FlexCAN_2 Buffer 5 Interrupt */
  CAN2_BUF6_IRQn               = 182u,             /**< FlexCAN_2 Buffer 6 Interrupt */
  CAN2_BUF7_IRQn               = 183u,             /**< FlexCAN_2 Buffer 7 Interrupt */
  CAN2_BUF8_IRQn               = 184u,             /**< FlexCAN_2 Buffer 8 Interrupt */
  CAN2_BUF9_IRQn               = 185u,             /**< FlexCAN_2 Buffer 9 Interrupt */
  CAN2_BUF10_IRQn              = 186u,             /**< FlexCAN_2 Buffer 10 Interrupt */
  CAN2_BUF11_IRQn              = 187u,             /**< FlexCAN_2 Buffer 11 Interrupt */
  CAN2_BUF12_IRQn              = 188u,             /**< FlexCAN_2 Buffer 12 Interrupt */
  CAN2_BUF13_IRQn              = 189u,             /**< FlexCAN_2 Buffer 13 Interrupt */
  CAN2_BUF14_IRQn              = 190u,             /**< FlexCAN_2 Buffer 14 Interrupt */
  CAN2_BUF15_IRQn              = 191u,             /**< FlexCAN_2 Buffer 15 Interrupt */
  CAN2_BUF16_31_IRQn           = 192u,             /**< FlexCAN_2 Buffers 31-16 Interrupts */
  CAN2_BUF32_63_IRQn           = 193u,             /**< FlexCAN_2 Buffers 63-32 Interrupts */
  FEC_TXF_IRQn                 = 194u,             /**< FEC Transmit Frame flag */
  FEC_RXF_IRQn                 = 195u,             /**< FEC Receive Frame flag */
  FEC_ERR_IRQn                 = 196u,             /**< Combined Interrupt Requests of the FEC Ethernet Interrupt Event Register */
  DEC0_IDF_IRQn                = 197u,             /**< Decimation 0 Input (Fill) */
