newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
  DEC0_OD_SD_IRQn              = 198u,             /**< Decimation 0 Output/Integ (Drain/Integ) */
  DEC0_ERR_IRQn                = 199u,             /**< Decimation 0 Error */
  STM_Ch0_IRQn                 = 200u,             /**< System Timer Module Interrupt 0 */
  STM_Ch123_IRQn               = 201u,             /**< System Timer Module Interrupts 1, 2, 3 */
  EMIOS0_CH16_IRQn             = 202u,             /**< eMIOS_0 channel 16 Flag */
  EMIOS0_CH17_IRQn             = 203u,             /**< eMIOS_0 channel 17 Flag */
  EMIOS0_CH18_IRQn             = 204u,             /**< eMIOS_0 channel 18 Flag */
  EMIOS0_CH19_IRQn             = 205u,             /**< eMIOS_0 channel 19 Flag */
  EMIOS0_CH20_IRQn             = 206u,             /**< eMIOS_0 channel 20 Flag */
  EMIOS0_CH21_IRQn             = 207u,             /**< eMIOS_0 channel 21 Flag */
  EMIOS0_CH22_IRQn             = 208u,             /**< eMIOS_0 channel 22 Flag */
  EMIOS0_CH23_IRQn             = 209u,             /**< eMIOS_0 channel 23 Flag */
  DMA0_ERR32_63_IRQn           = 210u,             /**< eDMA0 channel Error flags 32-63 */
  DMA0_32_IRQn                 = 211u,             /**< eDMA0 channel Interrupt 32 */
  DMA0_33_IRQn                 = 212u,             /**< eDMA0 channel Interrupt 33 */
  DMA0_34_IRQn                 = 213u,             /**< eDMA0 channel Interrupt 34 */
  DMA0_35_IRQn                 = 214u,             /**< eDMA0 channel Interrupt 35 */
  DMA0_36_IRQn                 = 215u,             /**< eDMA0 channel Interrupt 36 */
  DMA0_37_IRQn                 = 216u,             /**< eDMA0 channel Interrupt 37 */
  DMA0_38_IRQn                 = 217u,             /**< eDMA0 channel Interrupt 38 */
  DMA0_39_IRQn                 = 218u,             /**< eDMA0 channel Interrupt 39 */
  DMA0_40_IRQn                 = 219u,             /**< eDMA0 channel Interrupt 40 */
  DMA0_41_IRQn                 = 220u,             /**< eDMA0 channel Interrupt 41 */
  DMA0_42_IRQn                 = 221u,             /**< eDMA0 channel Interrupt 42 */
  DMA0_43_IRQn                 = 222u,             /**< eDMA0 channel Interrupt 43 */
  DMA0_44_IRQn                 = 223u,             /**< eDMA0 channel Interrupt 44 */
  DMA0_45_IRQn                 = 224u,             /**< eDMA0 channel Interrupt 45 */
  DMA0_46_IRQn                 = 225u,             /**< eDMA0 channel Interrupt 46 */
  DMA0_47_IRQn                 = 226u,             /**< eDMA0 channel Interrupt 47 */
  DMA0_48_IRQn                 = 227u,             /**< eDMA0 channel Interrupt 48 */
  DMA0_49_IRQn                 = 228u,             /**< eDMA0 channel Interrupt 49 */
  DMA0_50_IRQn                 = 229u,             /**< eDMA0 channel Interrupt 50 */
  DMA0_51_IRQn                 = 230u,             /**< eDMA0 channel Interrupt 51 */
  DMA0_52_IRQn                 = 231u,             /**< eDMA0 channel Interrupt 52 */
  DMA0_53_IRQn                 = 232u,             /**< eDMA0 channel Interrupt 53 */
  DMA0_54_IRQn                 = 233u,             /**< eDMA0 channel Interrupt 54 */
  DMA0_55_IRQn                 = 234u,             /**< eDMA0 channel Interrupt 55 */
  DMA0_56_IRQn                 = 235u,             /**< eDMA0 channel Interrupt 56 */
  DMA0_57_IRQn                 = 236u,             /**< eDMA0 channel Interrupt 57 */
  DMA0_58_IRQn                 = 237u,             /**< eDMA0 channel Interrupt 58 */
  DMA0_59_IRQn                 = 238u,             /**< eDMA0 channel Interrupt 59 */
  DMA0_60_IRQn                 = 239u,             /**< eDMA0 channel Interrupt 60 */
  DMA0_61_IRQn                 = 240u,             /**< eDMA0 channel Interrupt 61 */
  DMA0_62_IRQn                 = 241u,             /**< eDMA0 channel Interrupt 62 */
  DMA0_63_IRQn                 = 242u,             /**< eDMA0 channel Interrupt 63 */
  ETPU1_CIS0_IRQn              = 243u,             /**< eTPU Engine 1 Channel 0 Interrupt Status */
  ETPU1_CIS1_IRQn              = 244u,             /**< eTPU Engine 1 Channel 1 Interrupt Status */
  ETPU1_CIS2_IRQn              = 245u,             /**< eTPU Engine 1 Channel 2 Interrupt Status */
  ETPU1_CIS3_IRQn              = 246u,             /**< eTPU Engine 1 Channel 3 Interrupt Status */
  ETPU1_CIS4_IRQn              = 247u,             /**< eTPU Engine 1 Channel 4 Interrupt Status */
  ETPU1_CIS5_IRQn              = 248u,             /**< eTPU Engine 1 Channel 5 Interrupt Status */
  ETPU1_CIS6_IRQn              = 249u,             /**< eTPU Engine 1 Channel 6 Interrupt Status */
  ETPU1_CIS7_IRQn              = 250u,             /**< eTPU Engine 1 Channel 7 Interrupt Status */
  ETPU1_CIS8_IRQn              = 251u,             /**< eTPU Engine 1 Channel 8 Interrupt Status */
  ETPU1_CIS9_IRQn              = 252u,             /**< eTPU Engine 1 Channel 9 Interrupt Status */
  ETPU1_CIS10_IRQn             = 253u,             /**< eTPU Engine 1 Channel 10 Interrupt Status */
  ETPU1_CIS11_IRQn             = 254u,             /**< eTPU Engine 1 Channel 11 Interrupt Status */
  ETPU1_CIS12_IRQn             = 255u,             /**< eTPU Engine 1 Channel 12 Interrupt Status */
  ETPU1_CIS13_IRQn             = 256u,             /**< eTPU Engine 1 Channel 13 Interrupt Status */
  ETPU1_CIS14_IRQn             = 257u,             /**< eTPU Engine 1 Channel 14 Interrupt Status */
  ETPU1_CIS15_IRQn             = 258u,             /**< eTPU Engine 1 Channel 15 Interrupt Status */
  ETPU1_CIS16_IRQn             = 259u,             /**< eTPU Engine 1 Channel 16 Interrupt Status */
  ETPU1_CIS17_IRQn             = 260u,             /**< eTPU Engine 1 Channel 17 Interrupt Status */
  ETPU1_CIS18_IRQn             = 261u,             /**< eTPU Engine 1 Channel 18 Interrupt Status */
  ETPU1_CIS19_IRQn             = 262u,             /**< eTPU Engine 1 Channel 19 Interrupt Status */
  ETPU1_CIS20_IRQn             = 263u,             /**< eTPU Engine 1 Channel 20 Interrupt Status */
  ETPU1_CIS21_IRQn             = 264u,             /**< eTPU Engine 1 Channel 21 Interrupt Status */
  ETPU1_CIS22_IRQn             = 265u,             /**< eTPU Engine 1 Channel 22 Interrupt Status */
  ETPU1_CIS23_IRQn             = 266u,             /**< eTPU Engine 1 Channel 23 Interrupt Status */
  ETPU1_CIS24_IRQn             = 267u,             /**< eTPU Engine 1 Channel 24 Interrupt Status */
  ETPU1_CIS25_IRQn             = 268u,             /**< eTPU Engine 1 Channel 25 Interrupt Status */
  ETPU1_CIS26_IRQn             = 269u,             /**< eTPU Engine 1 Channel 26 Interrupt Status */
  ETPU1_CIS27_IRQn             = 270u,             /**< eTPU Engine 1 Channel 27 Interrupt Status */
  ETPU1_CIS28_IRQn             = 271u,             /**< eTPU Engine 1 Channel 28 Interrupt Status */
  ETPU1_CIS29_IRQn             = 272u,             /**< eTPU Engine 1 Channel 29 Interrupt Status */
  ETPU1_CIS30_IRQn             = 273u,             /**< eTPU Engine 1 Channel 30 Interrupt Status */
  ETPU1_CIS31_IRQn             = 274u,             /**< eTPU Engine 1 Channel 31 Interrupt Status */
  DSPI0_ERR_IRQn               = 275u,             /**< DSPI_0 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
  DSPI0_TXFIFO_EOQF_IRQn       = 276u,             /**< DSPI_0 transmit FIFO End of Queue Flag */
  DSPI0_TXFIFO_TFFF_IRQn       = 277u,             /**< DSPI_0 Transmit FIFO Fill Flag */
  DSPI0_TCF_IRQn               = 278u,             /**< DSPI_0 Transfer Complete/DSI Data Match Flag */
  DSPI0_RXFIFO_RFDF_IRQn       = 279u,             /**< DSPI_0 Receive FIFO Drain Flag */
  CAN1_ESR1_IRQn               = 280u,             /**< FlexCAN_1 Bus Off, Transmit Warning, Receive Warning */
  CAN1_ESR2_IRQn               = 281u,             /**< FlexCAN_1 Error, FlexCAN_1 ECC Correctable Error, FlexCAN_1 ECC Host Access Non-Correctable Error, FlexCAN_1 ECC CAN Access Non-Correctable Error */
  CAN1_BUF0_IRQn               = 283u,             /**< FlexCAN_1 Buffer 0 Interrupt */
  CAN1_BUF1_IRQn               = 284u,             /**< FlexCAN_1 Buffer 1 Interrupt */
  CAN1_BUF2_IRQn               = 285u,             /**< FlexCAN_1 Buffer 2 Interrupt */
  CAN1_BUF3_IRQn               = 286u,             /**< FlexCAN_1 Buffer 3 Interrupt */
  CAN1_BUF4_IRQn               = 287u,             /**< FlexCAN_1 Buffer 4 Interrupt */
  CAN1_BUF5_IRQn               = 288u,             /**< FlexCAN_1 Buffer 5 Interrupt */
  CAN1_BUF6_IRQn               = 289u,             /**< FlexCAN_1 Buffer 6 Interrupt */
  CAN1_BUF7_IRQn               = 290u,             /**< FlexCAN_1 Buffer 7 Interrupt */
  CAN1_BUF8_IRQn               = 291u,             /**< FlexCAN_1 Buffer 8 Interrupt */
  CAN1_BUF9_IRQn               = 292u,             /**< FlexCAN_1 Buffer 9 Interrupt */
  CAN1_BUF10_IRQn              = 293u,             /**< FlexCAN_1 Buffer 10 Interrupt */
  CAN1_BUF11_IRQn              = 294u,             /**< FlexCAN_1 Buffer 11 Interrupt */
  CAN1_BUF12_IRQn              = 295u,             /**< FlexCAN_1 Buffer 12 Interrupt */
  CAN1_BUF13_IRQn              = 296u,             /**< FlexCAN_1 Buffer 13 Interrupt */
  CAN1_BUF14_IRQn              = 297u,             /**< FlexCAN_1 Buffer 14 Interrupt */
  CAN1_BUF15_IRQn              = 298u,             /**< FlexCAN_1 Buffer 15 Interrupt */
  CAN1_BUF16_31_IRQn           = 299u,             /**< FlexCAN_1 Buffers 31-16 Interrupts */
  CAN1_BUF32_63_IRQn           = 300u,             /**< FlexCAN_1 Buffers 63-32 Interrupts */
  PIT_RTI0_IRQn                = 301u,             /**< Periodic Interrupt Timer Interrupt 0 */
  PIT_RTI1_IRQn                = 302u,             /**< Periodic Interrupt Timer Interrupt 1 */
  PIT_RTI2_IRQn                = 303u,             /**< Periodic Interrupt Timer Interrupt 2 */
  PIT_RTI3_IRQn                = 304u,             /**< Periodic Interrupt Timer Interrupt 3 */
  PIT_RTIINT_IRQn              = 305u,             /**< Real Time Interrupt Interrupt */
  FMC_Done_IRQn                = 307u,             /**< Flash memory program/erase complete */
  CAN3_ESR1_IRQn               = 308u,             /**< FlexCAN_3 Bus Off, Transmit Warning, Receive Warning */
  CAN3_ESR2_IRQn               = 309u,             /**< FlexCAN_3 Error, FlexCAN_3 ECC Correctable Error, FlexCAN_3 ECC Host Access Non-Correctable Error, FlexCAN_3 ECC CAN Access Non-Correctable Error */
  CAN3_BUF0_IRQn               = 311u,             /**< FlexCAN_3 Buffer 0 Interrupt */
  CAN3_BUF1_IRQn               = 312u,             /**< FlexCAN_3 Buffer 1 Interrupt */
  CAN3_BUF2_IRQn               = 313u,             /**< FlexCAN_3 Buffer 2 Interrupt */
  CAN3_BUF3_IRQn               = 314u,             /**< FlexCAN_3 Buffer 3 Interrupt */
  CAN3_BUF4_IRQn               = 315u,             /**< FlexCAN_3 Buffer 4 Interrupt */
  CAN3_BUF5_IRQn               = 316u,             /**< FlexCAN_3 Buffer 5 Interrupt */
  CAN3_BUF6_IRQn               = 317u,             /**< FlexCAN_3 Buffer 6 Interrupt */
  CAN3_BUF7_IRQn               = 318u,             /**< FlexCAN_3 Buffer 7 Interrupt */
  CAN3_BUF8_IRQn               = 319u,             /**< FlexCAN_3 Buffer 8 Interrupt */
  CAN3_BUF9_IRQn               = 320u,             /**< FlexCAN_3 Buffer 9 Interrupt */
  CAN3_BUF10_IRQn              = 321u,             /**< FlexCAN_3 Buffer 10 Interrupt */
  CAN3_BUF11_IRQn              = 322u,             /**< FlexCAN_3 Buffer 11 Interrupt */
  CAN3_BUF12_IRQn              = 323u,             /**< FlexCAN_3 Buffer 12 Interrupt */
  CAN3_BUF13_IRQn              = 324u,             /**< FlexCAN_3 Buffer 13 Interrupt */
  CAN3_BUF14_IRQn              = 325u,             /**< FlexCAN_3 Buffer 14 Interrupt */
  CAN3_BUF15_IRQn              = 326u,             /**< FlexCAN_3 Buffer 15 Interrupt */
  CAN3_BUF16_31_IRQn           = 327u,             /**< FlexCAN_3 Buffers 31-16 Interrupts */
  CAN3_BUF32_63_IRQn           = 328u,             /**< FlexCAN_3 Buffers 63-32 Interrupts */
  SRX0_GBL_STATUS_IRQn         = 329u,             /**< SENT_0 Module Interrupts */
  SRX0_CH0_IRQn                = 330u,             /**< SENT_0_CH0 Interrupts */
  SRX0_CH1_IRQn                = 331u,             /**< SENT_0_CH1 Interrupts */
  SRX0_CH2_IRQn                = 332u,             /**< SENT_0_CH2 Interrupts */
  SRX0_CH3_IRQn                = 333u,             /**< SENT_0_CH3 Interrupts */
  SRX0_CH4_IRQn                = 334u,             /**< SENT_0_CH4 Interrupts */
  SRX0_CH5_IRQn                = 335u,             /**< SENT_0_CH5 Interrupts */
  SRX1_GBL_STATUS_IRQn         = 336u,             /**< SENT_1 Module Interrupts */
  SRX1_CH0_IRQn                = 337u,             /**< SENT_1_CH0 Interrupts */
  SRX1_CH1_IRQn                = 338u,             /**< SENT_1_CH1 Interrupts */
  SRX1_CH2_IRQn                = 339u,             /**< SENT_1_CH2 Interrupts */
  SRX1_CH3_IRQn                = 340u,             /**< SENT_1_CH3 Interrupts */
  SRX1_CH4_IRQn                = 341u,             /**< SENT_1_CH4 Interrupts */
  SRX1_CH5_IRQn                = 342u,             /**< SENT_1_CH5 Interrupts */
  PMC_IRQn                     = 343u,             /**< Power Management Controller Interrupts */
  PMC_TEMP_IRQn                = 344u,             /**< Temperature Sensor Interrupts: TEMP0_0, TEMP0_2, TEMP0_3, TEMP1_0, TEMP1_2, TEMP1_3 of PMC_ESR_TD */
  JDC_IRQn                     = 345u,             /**< JDC Interrupts: JDC_MSR[JIN_INT] | JDC_MSR[JOUT_INT] */
  SIPI0_IRQn                   = 346u,             /**< SIPI Combined Interrupts: SIPI_ERR | SIPI_SR | SIPI_CSR0 */
  LFAST_IRQn                   = 347u,             /**< LFAST Combined Interrupts */
  MCAN_IRQn                    = 348u,             /**< M_CAN0_0, M_CAN0_1, M_CAN1_0, M_CAN1_1 Combined Interrupts */
  ERM_IRQn                     = 349u,             /**< ERM Combined Interrupts: Single bit Correction | Multi bit Detection */
  CMU01_IRQn                   = 350u,             /**< CMU_0, CMU_1 Clock Error Interrupts */
  CMU23_IRQn                   = 351u,             /**< CMU_2, CMU_3 Clock Error Interrupts */
  CMU45_IRQn                   = 352u,             /**< CMU_4, CMU_5 Clock Error Interrupts */
  CMU67_IRQn                   = 353u,             /**< CMU_6, CMU_7 Clock Error Interrupts */
  CMU8_IRQn                    = 354u,             /**< CMU_8 Clock Error Interrupts */
  CMU_RSV0_IRQn                = 355u,             /**< CMU_RSV0 */
  CMU_RSV1_IRQn                = 356u,             /**< CMU_RSV1 */
  CMU_RSV2_IRQn                = 357u,             /**< CMU_RSV2 */
  REACM_GBL_IRQn               = 358u,             /**< Reaction Module Global Interrupt: REACM_GEFR[OVR|EF7:0] */
  REACM_CH01_IRQn              = 359u,             /**< Reaction Channel 0 and Reaction Channel 1 Combined Interrupts */
  REACM_CH23_IRQn              = 360u,             /**< Reaction Channel 2 and Reaction Channel 3 Combined Interrupts */
  REACM_CH45_IRQn              = 361u,             /**< Reaction Channel 4 and Reaction Channel 5 Combined Interrupts */
  REACM_CH67_IRQn              = 362u,             /**< Reaction Channel 6 and Reaction Channel 7 Combined Interrupts */
  REACM_CH89_IRQn              = 363u,             /**< Reaction Channel 8 and Reaction Channel 9 Combined Interrupts */
  REACM_RSV0_IRQn              = 364u,             /**< REACM_RSV0 */
  REACM_RSV1_IRQn              = 365u,             /**< REACM_RSV1 */
  DEC1_IDF_IRQn                = 366u,             /**< Decimation 1 Input (Fill) */
  DEC1_OD_SD_IRQn              = 367u,             /**< Decimation 1 Output/Integ (Drain/Integ) */
  DEC1_ERR_IRQn                = 368u,             /**< Decimation 1 Error */
  ETPU2_GE_IRQn                = 369u,             /**< eTPU Engine 2 and 1 Global Exception */
  ETPU2_CIS0_IRQn              = 370u,             /**< eTPU Engine 2 Channel 0 Interrupt Status */
  ETPU2_CIS1_IRQn              = 371u,             /**< eTPU Engine 2 Channel 1 Interrupt Status */
  ETPU2_CIS2_IRQn              = 372u,             /**< eTPU Engine 2 Channel 2 Interrupt Status */
  ETPU2_CIS3_IRQn              = 373u,             /**< eTPU Engine 2 Channel 3 Interrupt Status */
  ETPU2_CIS4_IRQn              = 374u,             /**< eTPU Engine 2 Channel 4 Interrupt Status */
  ETPU2_CIS5_IRQn              = 375u,             /**< eTPU Engine 2 Channel 5 Interrupt Status */
  ETPU2_CIS6_IRQn              = 376u,             /**< eTPU Engine 2 Channel 6 Interrupt Status */
  ETPU2_CIS7_IRQn              = 377u,             /**< eTPU Engine 2 Channel 7 Interrupt Status */
  ETPU2_CIS8_IRQn              = 378u,             /**< eTPU Engine 2 Channel 8 Interrupt Status */
  ETPU2_CIS9_IRQn              = 379u,             /**< eTPU Engine 2 Channel 9 Interrupt Status */
  ETPU2_CIS10_IRQn             = 380u,             /**< eTPU Engine 2 Channel 10 Interrupt Status */
  ETPU2_CIS11_IRQn             = 381u,             /**< eTPU Engine 2 Channel 11 Interrupt Status */
  ETPU2_CIS12_IRQn             = 382u,             /**< eTPU Engine 2 Channel 12 Interrupt Status */
  ETPU2_CIS13_IRQn             = 383u,             /**< eTPU Engine 2 Channel 13 Interrupt Status */
  ETPU2_CIS14_IRQn             = 384u,             /**< eTPU Engine 2 Channel 14 Interrupt Status */
  ETPU2_CIS15_IRQn             = 385u,             /**< eTPU Engine 2 Channel 15 Interrupt Status */
  ETPU2_CIS16_IRQn             = 386u,             /**< eTPU Engine 2 Channel 16 Interrupt Status */
  ETPU2_CIS17_IRQn             = 387u,             /**< eTPU Engine 2 Channel 17 Interrupt Status */
  ETPU2_CIS18_IRQn             = 388u,             /**< eTPU Engine 2 Channel 18 Interrupt Status */
  ETPU2_CIS19_IRQn             = 389u,             /**< eTPU Engine 2 Channel 19 Interrupt Status */
  ETPU2_CIS20_IRQn             = 390u,             /**< eTPU Engine 2 Channel 20 Interrupt Status */
  ETPU2_CIS21_IRQn             = 391u,             /**< eTPU Engine 2 Channel 21 Interrupt Status */
  ETPU2_CIS22_IRQn             = 392u,             /**< eTPU Engine 2 Channel 22 Interrupt Status */
  ETPU2_CIS23_IRQn             = 393u,             /**< eTPU Engine 2 Channel 23 Interrupt Status */
  EQADC1_OVRx_IRQn             = 394u,             /**< eQADC combined overrun interrupt requests from all of the FIFOs: Trigger Overrun, Receive FIFO Overflow and command FIFO Underflow */
  EQADC1_FIFO0_NCF_IRQn        = 395u,             /**< eQADC command FIFO 0 Non-Coherency Flag */
  EQADC1_FIFO0_PF_IRQn         = 396u,             /**< eQADC command FIFO 0 Pause Flag */
  EQADC1_FIFO0_EOQF_IRQn       = 397u,             /**< eQADC command FIFO 0 command queue End of Queue Flag */
  EQADC1_FIFO0_CFFF_IRQn       = 398u,             /**< eQADC Command FIFO 0 Fill Flag */
  EQADC1_FIFO0_RFDF_IRQn       = 399u,             /**< eQADC Receive FIFO 0 Drain Flag */
  EQADC1_FIFO1_NCF_IRQn        = 400u,             /**< eQADC command FIFO 1 Non-Coherency Flag */
  EQADC1_FIFO1_PF_IRQn         = 401u,             /**< eQADC command FIFO 1 Pause Flag */
  EQADC1_FIFO1_EOQF_IRQn       = 402u,             /**< eQADC command FIFO 1 command queue End of Queue Flag */
  EQADC1_FIFO1_CFFF_IRQn       = 403u,             /**< eQADC Command FIFO 1 Fill Flag */
  EQADC1_FIFO1_RFDF_IRQn       = 404u,             /**< eQADC Receive FIFO 1 Drain Flag */
  EQADC1_FIFO2_NCF_IRQn        = 405u,             /**< eQADC command FIFO 2 Non-Coherency Flag */
  EQADC1_FIFO2_PF_IRQn         = 406u,             /**< eQADC command FIFO 2 Pause Flag */
  EQADC1_FIFO2_EOQF_IRQn       = 407u,             /**< eQADC command FIFO 2 command queue End of Queue Flag */
  EQADC1_FIFO2_CFFF_IRQn       = 408u,             /**< eQADC Command FIFO 2 Fill Flag */
  EQADC1_FIFO2_RFDF_IRQn       = 409u,             /**< eQADC Receive FIFO 2 Drain Flag */
  EQADC1_FIFO3_NCF_IRQn        = 410u,             /**< eQADC command FIFO 3 Non-Coherency Flag */
  EQADC1_FIFO3_PF_IRQn         = 411u,             /**< eQADC command FIFO 3 Pause Flag */
  EQADC1_FIFO3_EOQF_IRQn       = 412u,             /**< eQADC command FIFO 3 command queue End of Queue Flag */
  EQADC1_FIFO3_CFFF_IRQn       = 413u,             /**< eQADC Command FIFO 3 Fill Flag */
  EQADC1_FIFO3_RFDF_IRQn       = 414u,             /**< eQADC Receive FIFO 3 Drain Flag */
  EQADC1_FIFO4_NCF_IRQn        = 415u,             /**< eQADC command FIFO 4 Non-Coherency Flag */
  EQADC1_FIFO4_PF_IRQn         = 416u,             /**< eQADC command FIFO 4 Pause Flag */
  EQADC1_FIFO4_EOQF_IRQn       = 417u,             /**< eQADC command FIFO 4 command queue End of Queue Flag */
  EQADC1_FIFO4_CFFF_IRQn       = 418u,             /**< eQADC Command FIFO 4 Fill Flag */
  EQADC1_FIFO4_RFDF_IRQn       = 419u,             /**< eQADC Receive FIFO 4 Drain Flag */
  EQADC1_FIFO5_NCF_IRQn        = 420u,             /**< eQADC command FIFO 5 Non-Coherency Flag */
  EQADC1_FIFO5_PF_IRQn         = 421u,             /**< eQADC command FIFO 5 Pause Flag */
  EQADC1_FIFO5_EOQF_IRQn       = 422u,             /**< eQADC command FIFO 5 command queue End of Queue Flag */
  EQADC1_FIFO5_CFFF_IRQn       = 423u,             /**< eQADC Command FIFO 5 Fill Flag */
  EQADC1_FIFO5_RFDF_IRQn       = 424u,             /**< eQADC Receive FIFO 5 Drain Flag */
  DMA1_ERR0_31_IRQn            = 425u,             /**< eDMA1 channel Error flags 0-31 */
  DMA1_0_IRQn                  = 426u,             /**< eDMA1 channel Interrupt 0 */
  DMA1_1_IRQn                  = 427u,             /**< eDMA1 channel Interrupt 1 */
  DMA1_2_IRQn                  = 428u,             /**< eDMA1 channel Interrupt 2 */
  DMA1_3_IRQn                  = 429u,             /**< eDMA1 channel Interrupt 3 */
  DMA1_4_IRQn                  = 430u,             /**< eDMA1 channel Interrupt 4 */
  DMA1_5_IRQn                  = 431u,             /**< eDMA1 channel Interrupt 5 */
  DMA1_6_IRQn                  = 432u,             /**< eDMA1 channel Interrupt 6 */
  DMA1_7_IRQn                  = 433u,             /**< eDMA1 channel Interrupt 7 */
  DMA1_8_IRQn                  = 434u,             /**< eDMA1 channel Interrupt 8 */
  DMA1_9_IRQn                  = 435u,             /**< eDMA1 channel Interrupt 9 */
  DMA1_10_IRQn                 = 436u,             /**< eDMA1 channel Interrupt 10 */
  DMA1_11_IRQn                 = 437u,             /**< eDMA1 channel Interrupt 11 */
  DMA1_12_IRQn                 = 438u,             /**< eDMA1 channel Interrupt 12 */
  DMA1_13_IRQn                 = 439u,             /**< eDMA1 channel Interrupt 13 */
  DMA1_14_IRQn                 = 440u,             /**< eDMA1 channel Interrupt 14 */
  DMA1_15_IRQn                 = 441u,             /**< eDMA1 channel Interrupt 15 */
  DMA1_16_IRQn                 = 442u,             /**< eDMA1 channel Interrupt 16 */
  DMA1_17_IRQn                 = 443u,             /**< eDMA1 channel Interrupt 17 */
  DMA1_18_IRQn                 = 444u,             /**< eDMA1 channel Interrupt 18 */
  DMA1_19_IRQn                 = 445u,             /**< eDMA1 channel Interrupt 19 */
  DMA1_20_IRQn                 = 446u,             /**< eDMA1 channel Interrupt 20 */
  DMA1_21_IRQn                 = 447u,             /**< eDMA1 channel Interrupt 21 */
  DMA1_22_IRQn                 = 448u,             /**< eDMA1 channel Interrupt 22 */
  DMA1_23_IRQn                 = 449u,             /**< eDMA1 channel Interrupt 23 */
  DMA1_24_IRQn                 = 450u,             /**< eDMA1 channel Interrupt 24 */
  DMA1_25_IRQn                 = 451u,             /**< eDMA1 channel Interrupt 25 */
  DMA1_26_IRQn                 = 452u,             /**< eDMA1 channel Interrupt 26 */
  DMA1_27_IRQn                 = 453u,             /**< eDMA1 channel Interrupt 27 */
