newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
  DMA1_28_IRQn                 = 454u,             /**< eDMA1 channel Interrupt 28 */
  DMA1_29_IRQn                 = 455u,             /**< eDMA1 channel Interrupt 29 */
  DMA1_30_IRQn                 = 456u,             /**< eDMA1 channel Interrupt 30 */
  DMA1_31_IRQn                 = 457u,             /**< eDMA1 channel Interrupt 31 */
  SDADC1234_IRQn               = 458u,             /**< SDADC1 to SDADC4 Interrupts */
  EMIOS1_CH16_IRQn             = 459u,             /**< eMIOS_1 channel 16 Flag */
  EMIOS1_CH17_IRQn             = 460u,             /**< eMIOS_1 channel 17 Flag */
  EMIOS1_CH18_IRQn             = 461u,             /**< eMIOS_1 channel 18 Flag */
  EMIOS1_CH19_IRQn             = 462u,             /**< eMIOS_1 channel 19 Flag */
  EMIOS1_CH20_IRQn             = 463u,             /**< eMIOS_1 channel 20 Flag */
  EMIOS1_CH21_IRQn             = 464u,             /**< eMIOS_1 channel 21 Flag */
  EMIOS1_CH22_IRQn             = 465u,             /**< eMIOS_1 channel 22 Flag */
  EMIOS1_CH23_IRQn             = 466u,             /**< eMIOS_1 channel 23 Flag */
  DEC2_IDF_IRQn                = 467u,             /**< Decimation 2 Input (Fill) */
  DEC2_OD_SD_IRQn              = 468u,             /**< Decimation 2 Output/Integ (Drain/Integ) */
  DEC2_ERR_IRQn                = 469u,             /**< Decimation 2 Error */
  DEC3_IDF_IRQn                = 470u,             /**< Decimation 3 Input (Fill) */
  DEC3_OD_SD_IRQn              = 471u,             /**< Decimation 3 Output/Integ (Drain/Integ) */
  DEC3_ERR_IRQn                = 472u,             /**< Decimation 3 Error */
  ESCI2_CIR_IRQn               = 473u,             /**< Combined Interrupt Requests of ESCI Module 2 */
  ESCI3_CIR_IRQn               = 474u,             /**< Combined Interrupt Requests of ESCI Module 3 */
  ESCI4_CIR_IRQn               = 475u,             /**< Combined Interrupt Requests of ESCI Module 4 */
  DECFILTER4_IRQn              = 476u,             /**< Decimation Filter 4 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER5_IRQn              = 477u,             /**< Decimation Filter 5 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER6_IRQn              = 478u,             /**< Decimation Filter 6 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER7_IRQn              = 479u,             /**< Decimation Filter 7 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER8_IRQn              = 480u,             /**< Decimation Filter 8 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER9_IRQn              = 481u,             /**< Decimation Filter 9 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER10_IRQn             = 482u,             /**< Decimation Filter 10 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DECFILTER11_IRQn             = 483u,             /**< Decimation Filter 11 Input/Output/Err/Intg (Fill/Drain/Error/Intg) */
  DMA1_ERR32_63_IRQn           = 488u,             /**< eDMA1 channel Error flags 32-63 */
  DMA1_32_39_IRQn              = 489u,             /**< eDMA1 channel Interrupts 32-39 */
  DMA1_40_47_IRQn              = 490u,             /**< eDMA1 channel Interrupts 40-47 */
  DMA1_48_55_IRQn              = 491u,             /**< eDMA1 channel Interrupts 48-55 */
  DMA1_56_63_IRQn              = 492u,             /**< eDMA1 channel Interrupts 56-63 */
  ETPU2_CIS24_IRQn             = 493u,             /**< eTPU Engine 2 Channel 24 Interrupt Status */
  ETPU2_CIS25_IRQn             = 494u,             /**< eTPU Engine 2 Channel 25 Interrupt Status */
  ETPU2_CIS26_IRQn             = 495u,             /**< eTPU Engine 2 Channel 26 Interrupt Status */
  ETPU2_CIS27_IRQn             = 496u,             /**< eTPU Engine 2 Channel 27 Interrupt Status */
  ETPU2_CIS28_IRQn             = 497u,             /**< eTPU Engine 2 Channel 28 Interrupt Status */
  ETPU2_CIS29_IRQn             = 498u,             /**< eTPU Engine 2 Channel 29 Interrupt Status */
  ETPU2_CIS30_IRQn             = 499u,             /**< eTPU Engine 2 Channel 30 Interrupt Status */
  ETPU2_CIS31_IRQn             = 500u,             /**< eTPU Engine 2 Channel 31 Interrupt Status */
  SWT1_IRQn                    = 501u,             /**< Software Watchdog 1 Interrupt flag */
  SEMA4_CORE0_IRQn             = 502u,             /**< Core 0 requested semaphore has unlocked */
  SEMA4_CORE1_IRQn             = 503u,             /**< Core 1 requested semaphore has unlocked */
  CSE_IRQ_IRQn                 = 504u,             /**< CSE Interrupt */
  ESCI5_CIR_IRQn               = 505u,             /**< Combined Interrupt Requests of ESCI Module 5 */
  DSPI4_ERR_IRQn               = 506u,             /**< DSPI_4 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
  DSPI4_TXFIFO_EOQF_IRQn       = 507u,             /**< DSPI_4 transmit FIFO End of Queue Flag */
  DSPI4_TXFIFO_TFFF_IRQn       = 508u,             /**< DSPI_4 Transmit FIFO Fill Flag */
  DSPI4_TCF_IRQn               = 509u,             /**< DSPI_4 Transfer Complete/DSI Data Match Flag */
  DSPI4_RXFIFO_RFDF_IRQn       = 510u,             /**< DSPI_4 Receive FIFO Drain Flag */
  STCU_IRQn                    = 511u              /**< MBIST interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers_MPC5777C */


/* ---------------------------------------------------------------*/


/****************************************************************************/
/*                     MODULE : FMPLL                                       */
/****************************************************************************/

    struct FMPLL_tag {
    
        uint32_t FMPLL_reserved0000;  /* 0x0000-0x0003 */
        
        union {                 /* FMPLL Synthesizer Status Register */
            vuint32_t R;
            struct {
                vuint32_t:22;
                vuint32_t LOLF:1;
                vuint32_t LOC:1;
                vuint32_t MODE:1;
                vuint32_t PLLSEL:1;
                vuint32_t PLLREF:1;
                vuint32_t LOCKS:1;
                vuint32_t LOCK:1;
                vuint32_t LOCF:1;
                vuint32_t :2;
            } B;
        } SYNSR;
        
