newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
        union {                 /* Low/Mid Address Space Block Select Register */
            vuint32_t R;
            struct {
                vuint32_t:14;
                vuint32_t MSEL:2;
                vuint32_t:6;
                vuint32_t LSEL:10;
            } B;
        } LMSR; /* Legacy naming - refer to LMS in Reference Manual */
        
        union {                 /* High Address Space Block Select Register */
            vuint32_t R;
            struct {
                vuint32_t:22;
                vuint32_t HBSEL:10; /* Legacy naming - refer to HSEL in Reference Manual */
            } B;
        } HSR; /* Legacy naming - refer to HBS in Reference Manual */
        
        union {                 /* Address Register */
            vuint32_t R;
            struct {
                vuint32_t SAD:1;
                vuint32_t:13;
                vuint32_t ADDR:15;
                vuint32_t:3;
            } B;
        } AR; /* Legacy naming - refer to ADR in Reference Manual */
        
        union {                 /* Platform Flash Configuration Register 1 */
            vuint32_t R;
            struct {
                vuint32_t:7;
#ifdef COMP_TO_MPC5634M_V1_6_ON
				vuint32_t GCE:1;
#else
                vuint32_t M8PFE:1;     /* Core 0 Nexus */
#endif
                vuint32_t:1;           /* EBI Testing - Reserved */
                vuint32_t:1;           /* Reserved */
                vuint32_t:1;           /* Reserved */
                vuint32_t:1;           /* Reserved */
                vuint32_t:1;           /* Reserved */
                vuint32_t:1;           /* Reserved */
                vuint32_t:1;           /* Reserved */
                vuint32_t M0PFE:1;     /* Core 0 */
                vuint32_t APC:3;
                vuint32_t WWSC:2;
                vuint32_t RWSC:3;
                vuint32_t:1;
                vuint32_t DPFEN:1;
                vuint32_t ARB:1;
                vuint32_t IPFEN:1;
                vuint32_t PRI:1;
                vuint32_t PFLIM:2;
                vuint32_t BFEN:1;
            } B;
        } BIUCR; /* Legacy naming - PFCR1 */
        
        union {                 /*Platform Flash Access Protection Register */
            vuint32_t R;
            struct {
                vuint32_t:12;
                vuint32_t M9AP:2;     /* Core 1 Nexus */
                vuint32_t M8AP:2;     /* Core 0 Nexus */
                vuint32_t:2;          /* EBI Testing - Reserved */
                vuint32_t M6AP:2;     /* FlexRay  */
                vuint32_t M5AP:2;     /* eDMA_B   */
                vuint32_t M4AP:2;     /* eDMA_A   */
                vuint32_t:2;          /* Reserved */
                vuint32_t:2;          /* Reserved */
                vuint32_t M1AP:2;     /* Core 1 */
                vuint32_t M0AP:2;     /* Core 0 */
            } B;
        } BIUAPR; /* Legacy naming - refer to PFAPR in Reference Manual */
        
        union {                 /* Platform Flash Configuration Register 2 */
            vuint32_t R;
            struct {
                vuint32_t LBCFG_P0:2;
                vuint32_t LBCFG_P1:2;
                vuint32_t:28;
            } B;
        } BIUCR2;
        
        union {                 /* Platform Flash Configuration Register 3 */
            vuint32_t R;
            struct {
                vuint32_t:6;
                vuint32_t M9PFE:1;
                vuint32_t:2;
                vuint32_t M6PFE:1;
                vuint32_t M5PFE:1;
                vuint32_t M4PFE:1;
                vuint32_t:2;
                vuint32_t M1PFE:1;
                vuint32_t:10;
                vuint32_t DPFEN:1;
                vuint32_t:1;
                vuint32_t IPFEN:1;
                vuint32_t:1;
                vuint32_t PFLIM:2;
                vuint32_t BFEN:1;
            } B;
        } BIUCR3;

        uint32_t FLASH_reserved002C[4];  /* 0x002C-0x003B */

        union {                 /* User Test Register 0 */
            vuint32_t R;
            struct {
                vuint32_t UTE:1;
                vuint32_t SCBE:1;
                vuint32_t:6;
                vuint32_t DSI:8;
                vuint32_t:8;
                vuint32_t EA:1;
                vuint32_t:1;
                vuint32_t MRE:1;
                vuint32_t MRV:1;
                vuint32_t EIE:1;
                vuint32_t AIS:1;
                vuint32_t AIE:1;
                vuint32_t AID:1;
            } B;
        } UT0;

        union {                 /* User Test Register 1 */
            vuint32_t R;
            struct {
                vuint32_t DAI:32;
            } B;
        } UT1;

        union {                 /* User Test Register 2 */
            vuint32_t R;
            struct {
                vuint32_t DAI:32;
            } B;
        } UT2;

        uint32_t FLASH_reserved0048[4078];  /* 0x0048-0x3FFF */
    };

/****************************************************************************/
/*                     MODULE : SIU                                         */
/****************************************************************************/

/* ----------------------------------------------------------------------------
   -- SIU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_Peripheral_Access_Layer SIU Peripheral Access Layer
 * @{
 */


/** SIU - Size of Registers Arrays */
#define SIU_PCR_COUNT                            512u
#define SIU_GPDO_COUNT                           512u
#define SIU_GPDIL_COUNT                          256u
#define SIU_TBG_CR_A_COUNT                       6u
#define SIU_TBG_CR_B_COUNT                       6u
#define SIU_PGPDO_COUNT                          16u
#define SIU_PGPDI_COUNT                          16u
#define SIU_MPGPDO_COUNT                         32u
#define SIU_DSPIx_COUNT                          4u
#define SIU_GPDI_COUNT                           512u

/** SIU - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __I  uint32_t MIDR;                              /**< MCU Identification Register, offset: 0x4 */
       uint8_t RESERVED_1[4];
  __IO uint32_t RSR;                               /**< Reset Status Register, offset: 0xC */
  __IO uint32_t SRCR;                              /**< System Reset Control Register, offset: 0x10 */
  __IO uint32_t EISR;                              /**< External IRQ Status Register, offset: 0x14 */
  __IO uint32_t DIRER;                             /**< DMA/Interrupt Request Enable Register, offset: 0x18 */
  __IO uint32_t DIRSR;                             /**< DMA/Interrupt Request Select Register, offset: 0x1C */
  __IO uint32_t OSR;                               /**< Overrun Status Register, offset: 0x20 */
  __IO uint32_t ORER;                              /**< Overrun Request Enable Register, offset: 0x24 */
  __IO uint32_t IREER;                             /**< IRQ Rising-Edge Event Enable Register, offset: 0x28 */
  __IO uint32_t IFEER;                             /**< IRQ Falling-Edge Event Enable Register, offset: 0x2C */
  __IO uint32_t IDFR;                              /**< IRQ Digital Filter Register, offset: 0x30 */
  __I  uint32_t IFIR;                              /**< IRQ Filtered Input Register, offset: 0x34 */
       uint8_t RESERVED_2[8];
  __IO uint16_t PCR[SIU_PCR_COUNT];                /**< Pad Configuration Register, array offset: 0x40, array step: 0x2 */
       uint8_t RESERVED_3[448];
  __IO uint8_t GPDO[SIU_GPDO_COUNT];               /**< GPIO Pin Data Output Register, array offset: 0x600, array step: 0x1 */
  __I  uint8_t GPDIL[SIU_GPDIL_COUNT];             /**< GPIO Pin Data Input Register (legacy), array offset: 0x800, array step: 0x1 */
       uint8_t RESERVED_4[4];
  __IO uint32_t EIISR;                             /**< External IRQ Input Select Register, offset: 0x904 */
  __IO uint32_t DISR;                              /**< DSPI Input Select Register, offset: 0x908 */
       uint8_t RESERVED_5[4];
  __IO uint32_t ISEL4;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x910 */
  __IO uint32_t ISEL5;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x914 */
  __IO uint32_t ISEL6;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x918 */
  __IO uint32_t ISEL7;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x91C */
  __IO uint32_t ISEL8;                             /**< eTPU_A Input Select Register, offset: 0x920 */
  __IO uint32_t ISEL9;                             /**< eQADC Advance Trigger Source Register, offset: 0x924 */
  __IO uint32_t DECFIL1;                           /**< Decimation Filter Register 1, offset: 0x928 */
  __IO uint32_t DECFIL2;                           /**< Decimation Filter Register 2, offset: 0x92C */
  __IO uint32_t DECFIL3;                           /**< Decimation Filter Register 3, offset: 0x930 */
  __IO uint32_t DECFIL4;                           /**< Decimation Filter Register 4, offset: 0x934 */
  __IO uint32_t DECFIL5;                           /**< Decimation Filter Register 5, offset: 0x938 */
       uint32_t RESERVED_6[20];
  __IO uint32_t CCR;                               /**< Chip Configuration Register, offset: 0x980 */
  __IO uint32_t ECCR;                              /**< External Clock Control Register, offset: 0x984 */
       uint8_t RESERVED_7[12];
  __IO uint32_t SYSDIV;                            /**< System Clock Register, offset: 0x9A0 */
  __IO uint32_t HLT1;                              /**< Halt Register 1, offset: 0x9A4 */
  __I  uint32_t HLTACK1;                           /**< Halt Acknowledge Register 1, offset: 0x9A8 */
  __IO uint32_t RSTVEC0;                           /**< Core0 Reset Vector Register, offset: 0x9AC */
  __IO uint32_t RSTVEC1;                           /**< Core1 Reset Vector Register, offset: 0x9B0 */
  __IO uint32_t C0PID;                             /**< Core0 PID mapping control register, offset: 0x9B4 */
  __IO uint32_t C1PID;                             /**< Core1 PID mapping control register, offset: 0x9B8 */
       uint32_t RESERVED_8[145];
  __IO uint32_t PGPDO[SIU_PGPDO_COUNT];            /**< Parallel GPIO Pin Data Output Registers, array offset: 0xC00, array step: 0x4 */
  __I  uint32_t PGPDI[SIU_PGPDI_COUNT];            /**< Parallel GPIO Pin Data Input Registers, array offset: 0xC40, array step: 0x4 */
  __O  uint32_t MPGPDO[SIU_MPGPDO_COUNT];          /**< Masked Parallel GPIO Pin Data Output Registers, array offset: 0xC80, array step: 0x4 */
  struct {                                         /* offset: 0xD00, array step: 0x8 */
    __IO uint32_t DSPIH;                             /**< Mask-Output High Register, array offset: 0xD00, array step: 0x8 */
    __IO uint32_t DSPIL;                             /**< Mask-Output Low Register, array offset: 0xD04, array step: 0x8 */
  } DSPIx[SIU_DSPIx_COUNT];
       uint8_t RESERVED_9[32];
  __IO uint32_t ETPUBA;                            /**< Serialized Output Signal Selection Register for DSPI_A, offset: 0xD40 */
  __IO uint32_t EMIOSA;                            /**< Serialized Output Signal Selection Register for DSPI_A, offset: 0xD44 */
  __IO uint32_t DSPIAHLA;                          /**< Serialized Output Signal Selection Register for DSPI_A, offset: 0xD48 */
       uint8_t RESERVED_10[4];
  __IO uint32_t ETPUAB;                            /**< Serialized Output Signal Selection Register for DSPI_B, offset: 0xD50 */
  __IO uint32_t EMIOSB;                            /**< Serialized Output Signal Selection Register for DSPI_B, offset: 0xD54 */
  __IO uint32_t DSPIBHLB;                          /**< Serialized Output Signal Selection Register for DSPI_B, offset: 0xD58 */
       uint8_t RESERVED_11[4];
  __IO uint32_t ETPUAC;                            /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD60 */
  __IO uint32_t EMIOSC;                            /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD64 */
  __IO uint32_t DSPICHLC;                          /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD68 */
  __IO uint32_t ETPUBC;                            /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD6C */
  __IO uint32_t ETPUBD;                            /**< Serialized Output Signal Selection Register for DSPI_D, offset: 0xD70 */
  __IO uint32_t EMIOSD;                            /**< Serialized Output Signal Selection Register for DSPI_D, offset: 0xD74 */
  __IO uint32_t DSPIDHLD;                          /**< Serialized Output Signal Selection Register for DSPI_D, offset: 0xD78 */
       uint8_t RESERVED_12[132];
  __I  uint8_t GPDI[SIU_GPDI_COUNT];               /**< GPIO Pin Data Input Register, array offset: 0xE00, array step: 0x1 */
       uint32_t RESERVED_13[512];
} SIU_Type, *SIU_MemMapPtr;

 /** Number of instances of the SIU module. */
#define SIU_INSTANCE_COUNT                       (1u)


/* SIU - Peripheral instance base addresses */
/** Peripheral SIU base address */
#define SIU_BASE                                 (0xC3F90000u)
/** Peripheral SIU base pointer */
#define SIU                                      ((SIU_Type *)SIU_BASE)
/** Array initializer of SIU peripheral base addresses */
#define SIU_BASE_ADDRS                           { SIU_BASE }
/** Array initializer of SIU peripheral base pointers */
#define SIU_BASE_PTRS                            { SIU }

/* ----------------------------------------------------------------------------
   -- SIU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_Register_Masks SIU Register Masks
 * @{
 */

