newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
 /** Number of instances of the SIU_B module. */
#define SIU_B_INSTANCE_COUNT                     (1u)


/* SIU_B - Peripheral instance base addresses */
/** Peripheral SIU_B base address */
#define SIU_B_BASE                               (0xC3F98000u)
/** Peripheral SIU_B base pointer */
#define SIU_B                                    ((SIU_B_Type *)SIU_B_BASE)
/** Array initializer of SIU_B peripheral base addresses */
#define SIU_B_BASE_ADDRS                         { SIU_B_BASE }
/** Array initializer of SIU_B peripheral base pointers */
#define SIU_B_BASE_PTRS                          { SIU_B }

/* ----------------------------------------------------------------------------
   -- SIU_B Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_B_Register_Masks SIU_B Register Masks
 * @{
 */

/* PCRM Bit Fields */
#define SIU_B_PCRM_WPS_MASK                      0x1u
#define SIU_B_PCRM_WPS_SHIFT                     0u
#define SIU_B_PCRM_WPS_WIDTH                     1u
#define SIU_B_PCRM_WPS(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_WPS_SHIFT))&SIU_B_PCRM_WPS_MASK)
#define SIU_B_PCRM_WPE_MASK                      0x2u
#define SIU_B_PCRM_WPE_SHIFT                     1u
#define SIU_B_PCRM_WPE_WIDTH                     1u
#define SIU_B_PCRM_WPE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_WPE_SHIFT))&SIU_B_PCRM_WPE_MASK)
#define SIU_B_PCRM_SRC_MASK                      0xCu
#define SIU_B_PCRM_SRC_SHIFT                     2u
#define SIU_B_PCRM_SRC_WIDTH                     2u
#define SIU_B_PCRM_SRC(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_SRC_SHIFT))&SIU_B_PCRM_SRC_MASK)
#define SIU_B_PCRM_HYS_MASK                      0x10u
#define SIU_B_PCRM_HYS_SHIFT                     4u
#define SIU_B_PCRM_HYS_WIDTH                     1u
#define SIU_B_PCRM_HYS(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_HYS_SHIFT))&SIU_B_PCRM_HYS_MASK)
#define SIU_B_PCRM_ODE_MASK                      0x20u
#define SIU_B_PCRM_ODE_SHIFT                     5u
#define SIU_B_PCRM_ODE_WIDTH                     1u
#define SIU_B_PCRM_ODE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_ODE_SHIFT))&SIU_B_PCRM_ODE_MASK)
#define SIU_B_PCRM_DSC_MASK                      0xC0u
#define SIU_B_PCRM_DSC_SHIFT                     6u
#define SIU_B_PCRM_DSC_WIDTH                     2u
#define SIU_B_PCRM_DSC(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_DSC_SHIFT))&SIU_B_PCRM_DSC_MASK)
#define SIU_B_PCRM_IBE_MASK                      0x100u
#define SIU_B_PCRM_IBE_SHIFT                     8u
#define SIU_B_PCRM_IBE_WIDTH                     1u
#define SIU_B_PCRM_IBE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_IBE_SHIFT))&SIU_B_PCRM_IBE_MASK)
#define SIU_B_PCRM_OBE_MASK                      0x200u
#define SIU_B_PCRM_OBE_SHIFT                     9u
#define SIU_B_PCRM_OBE_WIDTH                     1u
#define SIU_B_PCRM_OBE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_OBE_SHIFT))&SIU_B_PCRM_OBE_MASK)
#define SIU_B_PCRM_PA_MASK                       0x1C00u
#define SIU_B_PCRM_PA_SHIFT                      10u
#define SIU_B_PCRM_PA_WIDTH                      3u
#define SIU_B_PCRM_PA(x)                         (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_PA_SHIFT))&SIU_B_PCRM_PA_MASK)
/* GPDOM Bit Fields */
#define SIU_B_GPDOM_PDOn_MASK                    0x1u
#define SIU_B_GPDOM_PDOn_SHIFT                   0u
#define SIU_B_GPDOM_PDOn_WIDTH                   1u
#define SIU_B_GPDOM_PDOn(x)                      (((uint8_t)(((uint8_t)(x))<<SIU_B_GPDOM_PDOn_SHIFT))&SIU_B_GPDOM_PDOn_MASK)
/* GPDIM Bit Fields */
#define SIU_B_GPDIM_PDIn_MASK                    0x1u
#define SIU_B_GPDIM_PDIn_SHIFT                   0u
#define SIU_B_GPDIM_PDIn_WIDTH                   1u
#define SIU_B_GPDIM_PDIn(x)                      (((uint8_t)(((uint8_t)(x))<<SIU_B_GPDIM_PDIn_SHIFT))&SIU_B_GPDIM_PDIn_MASK)

/*!
 * @}
 */ /* end of group SIU_B_Register_Masks */


/*!
 * @}
 */ /* end of group SIU_B_Peripheral_Access_Layer */

/****************************************************************************/
/*                          MODULE : EMIOS                                  */
/****************************************************************************/

    struct EMIOS_tag {
    
        union {                  /* Module Configuration Register */
            vuint32_t R;
            struct {
                vuint32_t:1;
                vuint32_t MDIS:1;
                vuint32_t FRZ:1;
                vuint32_t GTBE:1;
                vuint32_t ETB:1;
                vuint32_t GPREN:1;
                vuint32_t:6;
                vuint32_t SRV:4;
                vuint32_t GPRE:8;
                vuint32_t:8;
            } B;
        } MCR;
        
        union {                  /* Global FLAG Register */
            vuint32_t R;
            struct {
                vuint32_t F31:1;
                vuint32_t F30:1;
                vuint32_t F29:1;
                vuint32_t F28:1;
                vuint32_t F27:1;
                vuint32_t F26:1;
                vuint32_t F25:1;
                vuint32_t F24:1;
                vuint32_t F23:1;
                vuint32_t F22:1;
                vuint32_t F21:1;
                vuint32_t F20:1;
                vuint32_t F19:1;
                vuint32_t F18:1;
                vuint32_t F17:1;
                vuint32_t F16:1;
                vuint32_t F15:1;
                vuint32_t F14:1;
                vuint32_t F13:1;
                vuint32_t F12:1;
                vuint32_t F11:1;
                vuint32_t F10:1;
                vuint32_t F9:1;
                vuint32_t F8:1;
                vuint32_t F7:1;
                vuint32_t F6:1;
                vuint32_t F5:1;
                vuint32_t F4:1;
                vuint32_t F3:1;
                vuint32_t F2:1;
                vuint32_t F1:1;
                vuint32_t F0:1;
            } B;
        } GFR;
        
        union {                 /* Output Update Disable Register */
            vuint32_t R;
            struct {
                vuint32_t OU31:1;
                vuint32_t OU30:1;
                vuint32_t OU29:1;
                vuint32_t OU28:1;
                vuint32_t OU27:1;
                vuint32_t OU26:1;
                vuint32_t OU25:1;
                vuint32_t OU24:1;
                vuint32_t OU23:1;
                vuint32_t OU22:1;
                vuint32_t OU21:1;
                vuint32_t OU20:1;
                vuint32_t OU19:1;
                vuint32_t OU18:1;
                vuint32_t OU17:1;
                vuint32_t OU16:1;
                vuint32_t OU15:1;
                vuint32_t OU14:1;
                vuint32_t OU13:1;
                vuint32_t OU12:1;
                vuint32_t OU11:1;
                vuint32_t OU10:1;
                vuint32_t OU9:1;
                vuint32_t OU8:1;
                vuint32_t OU7:1;
                vuint32_t OU6:1;
                vuint32_t OU5:1;
                vuint32_t OU4:1;
                vuint32_t OU3:1;
                vuint32_t OU2:1;
                vuint32_t OU1:1;
                vuint32_t OU0:1;
            } B;
        } OUDR;
        
        uint32_t eMIOS_reserved000C[5]; /* 0x000C-0x001F */
        
