newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
        uint32_t XBAR_reserved604[3];  /* 0x0604-0x060F */
        
        union {               /* General Purpose Control Register for Slave Port 6 */
            vuint32_t R;
            struct {
                vuint32_t RO:1;
                vuint32_t:21;
                vuint32_t ARB:2;
                vuint32_t:2;
                vuint32_t PCTL:2;
                vuint32_t:1;
                vuint32_t PARK:3;
            } B;
        } SGPCR6;
        
        uint32_t XBAR_reserved0614[59];  /* 0x0614-0x06FF */
        
        union {                 /* Master Priority Register for Slave Port 7 */
            vuint32_t R;
            struct {
                vuint32_t:1;
                vuint32_t MSTR7:3; /* EBI (development bus) */
                vuint32_t:1;
                vuint32_t MSTR6:3; /* FlexRay */
                vuint32_t:1;
                vuint32_t MSTR5:3; /* eDMA_B */
                vuint32_t:1;
                vuint32_t MSTR4:3; /* eDMA_A */
                vuint32_t:1;
                vuint32_t MSTR3:3; /* e200z7 core 1 Data, and Nexus 3 */
                vuint32_t:1;
                vuint32_t MSTR2:3; /* e200z7 core 1 CPU Instruction */
                vuint32_t:1;
                vuint32_t MSTR1:3; /* e200z7 core 0 Data, and Nexus 3 */
                vuint32_t:1;
                vuint32_t MSTR0:3; /* e200z7 core 0 CPU Instruction */
            } B;
        } MPR7;
        
        uint32_t XBAR_reserved704[3];  /* 0x0704-0x070F */
        
        union {
            vuint32_t R;
            struct {
                vuint32_t RO:1;
                  vuint32_t:21;
                vuint32_t ARB:2;
                  vuint32_t:2;
                vuint32_t PCTL:2;
                  vuint32_t:1;
                vuint32_t PARK:3;
            } B;
        } SGPCR7;               /* General Purpose Control Register for Slave Port 7 */
        
        uint32_t XBAR_reserved0714[59];  /* 0x0714-0x07FF */
        
        uint32_t XBAR_reserved0800[3584];  /* 0x0800-0x3FFF */
    };

/****************************************************************************/
/*                          MODULE : MPU                                    */
/****************************************************************************/

    struct MPU_tag {
    
        union {                 /* Module Control/Error Status Register */
            vuint32_t R;
            struct {
                vuint32_t SPERR:8;
                  vuint32_t:4;
                vuint32_t HRL:4;
                vuint32_t NSP:4;
                vuint32_t NRGD:4;
                  vuint32_t:7;
                vuint32_t VLD:1;
            } B;
        } CESR;
        
        uint32_t MPU_reserved0004[3]; /* 0x0004-0x000F */
        
        struct {
            union {             /* MPU Error Address Registers */
                vuint32_t R;
                struct {
                    vuint32_t EADDR:32;
                } B;
            } EAR;
            
            union {             /* MPU Error Detail Registers */
                vuint32_t R;
                struct {
                    vuint32_t EACD:16;
                    vuint32_t EPID:8;
                    vuint32_t EMN:4;
                    vuint32_t EATTR:3;
                    vuint32_t ERW:1;
                } B;
            } EDR;
        } PORT[4];
        
        uint32_t MPU_reserved0030[244];  /* 0x0028-0x03FF */
        
        struct {
            union {            /* Region Descriptor n Word 0 */
                vuint32_t R;
                struct {
                    vuint32_t SRTADDR:27;
                    vuint32_t:5;
                } B;
            } WORD0;
            
            union {            /* Region Descriptor n Word 1 */
                vuint32_t R;
                struct {
                    vuint32_t ENDADDR:27;
                    vuint32_t:5;
                } B;
            } WORD1;
            
            union {            /* Region Descriptor n Word 2 */
                vuint32_t R;
                struct {
                    vuint32_t M7RE:1;   /* Reserved */
                    vuint32_t M7WE:1;   /* Reserved */
                    vuint32_t M6RE:1;   /* FlexRay Read Enable */
                    vuint32_t M6WE:1;   /* FlexRay Write Enable */
                    vuint32_t M5RE:1;   /* eDMA_B Read Enable */
                    vuint32_t M5WE:1;   /* eDMA_B Write Enable */
                    vuint32_t M4RE:1;   /* eDMA_A Read Enable */
                    vuint32_t M4WE:1;   /* eDMA_A Write Enable */
                    vuint32_t M3PE:1;   /* Reserved */
                    vuint32_t M3SM:2;   /* Reserved */
                    vuint32_t M3UM:3;   /* Reserved */
                    vuint32_t M2PE:1;   /* Reserved */
                    vuint32_t M2SM:2;   /* Reserved */
                    vuint32_t M2UM:3;   /* Reserved */
                    vuint32_t M1PE:1;   /* Core 1 PID Enable */
                    vuint32_t M1SM:2;   /* Core 1 Supervisor Mode Access */
                    vuint32_t M1UM:3;   /* Core 1 User Mode Access */
                    vuint32_t M0PE:1;   /* Core 0 PID Enable */
                    vuint32_t M0SM:2;   /* Core 0 Supervisor Mode Access */
                    vuint32_t M0UM:3;   /* Core 0 User Mode Access */
                } B;
            } WORD2;
            
            union {            /* Region Descriptor n Word 3 */
                vuint32_t R;
                struct {
                    vuint32_t PID:8;
                    vuint32_t PIDMASK:8;
                      vuint32_t:15;
                    vuint32_t VLD:1;
                } B;
            } WORD3;
        } RGD[16];
        
        uint32_t MPU_reserved0500[192];  /* 0x0500-0x07FF */
        
        union {           /* Region Descriptor Alternate Access Control n */
            vuint32_t R;
            struct {
                vuint32_t M7RE:1;   /* Reserved */
                vuint32_t M7WE:1;   /* Reserved */
                vuint32_t M6RE:1;   /* FlexRay Read Enable */
                vuint32_t M6WE:1;   /* FlexRay Write Enable */
                vuint32_t M5RE:1;   /* eDMA_B Read Enable */
                vuint32_t M5WE:1;   /* eDMA_B Write Enable */
                vuint32_t M4RE:1;   /* eDMA_A Read Enable */
                vuint32_t M4WE:1;   /* eDMA_A Write Enable */
                vuint32_t M3PE:1;   /* Reserved */
                vuint32_t M3SM:2;   /* Reserved */
                vuint32_t M3UM:3;   /* Reserved */
                vuint32_t M2PE:1;   /* Reserved */
                vuint32_t M2SM:2;   /* Reserved */
                vuint32_t M2UM:3;   /* Reserved */
                vuint32_t M1PE:1;   /* Core 1 PID Enable */
                vuint32_t M1SM:2;   /* Core 1 Supervisor Mode Access */
                vuint32_t M1UM:3;   /* Core 1 User Mode Access */
                vuint32_t M0PE:1;   /* Core 0 PID Enable */
                vuint32_t M0SM:2;   /* Core 0 Supervisor Mode Access */
                vuint32_t M0UM:3;   /* Core 0 User Mode Access */
            } B;
        } RGDAAC[16];
        
        uint32_t MPU_reserved0840[3568];  /* 0x0840-0x3FFF */
    
