newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
    };

/****************************************************************************/
/*                     MODULE : SWT                                         */
/****************************************************************************/

    struct SWT_tag {
    
        union {                  /* Module Configuration Register */
            vuint32_t R;
            struct {
                vuint32_t MAP0:1;
                vuint32_t MAP1:1;
                vuint32_t:1;
                vuint32_t:1;
                vuint32_t MAP4:1;
                vuint32_t MAP5:1;
                vuint32_t MAP6:1;
                vuint32_t MAP7:1;
                vuint32_t:14;
                vuint32_t KEY:1;
                vuint32_t RIA:1;
                vuint32_t WND:1;
                vuint32_t ITR:1;
                vuint32_t HLK:1;
                vuint32_t SLK:1;
                vuint32_t CSL:1;
                vuint32_t STP:1;
                vuint32_t FRZ:1;
                vuint32_t WEN:1;
            } B;
        } MCR;
        
        union {                /* Interrupt register */
            vuint32_t R;
            struct {
                vuint32_t :31;
                vuint32_t TIF:1;
            } B;
        } IR;
        
        union {                /* Timeout register */
            vuint32_t R;
            struct {
                vuint32_t WTO:32;
            } B;
        } TO;
        
        union {                /* Window register */
            vuint32_t R;
            struct {
                vuint32_t WST:32;
            } B;
        } WN;
        
        union {                /* Service register */
            vuint32_t R;
            struct {
                vuint32_t :16;
                vuint32_t WSC:16;
            } B;
        } SR;
        
        union {                /* Counter output register */
            vuint32_t R;
            struct {
                vuint32_t CNT:32;
            } B;
        } CO;
        
        union {                /* Service key register */
            vuint32_t R;
            struct {
                vuint32_t :16;
                vuint32_t SK:16;
            } B;
        } SK;
        
        uint32_t SWT_reserved001C[4089]; /* 0x001C-0x3FFF */
    
    };

/****************************************************************************/
/*                     MODULE : STM                                         */
/****************************************************************************/

    struct STM_tag {
    
        union {                  /* Control Register */
            vuint32_t R;
            struct {
                vuint32_t :16;
                vuint32_t CPS:8;
                vuint32_t :6;
                vuint32_t FRZ:1;
                vuint32_t TEN:1;
            } B;
        } CR;
        
        union {                /* STM Counter */
            vuint32_t R;
        } CNT;
        
        uint32_t STM_reserved0008[2];  /* 0x0008-0x000F */
        
        /* channel 0 registers */
		    union {
            vuint32_t R;
            struct {
                vuint32_t :31;
             	vuint32_t CEN:1;   			
            } B;
        } CCR0;                /* Chan 0 Control Register */
        
        union {
    	    vuint32_t R;
            struct {
                vuint32_t :31;
                vuint32_t CIF:1;
        	} B;
        } CIR0;                /* Chan 0 Interrupt Register */
	
		    union {
    	    vuint32_t R;
        } CMP0;                /* Chan 0 Compare Register */

		    uint32_t STM_reserved2[1];
	
        /* channel 1 registers */
		    union {
            vuint32_t R;
            struct {
                vuint32_t :31;
             	vuint32_t CEN:1;   			
            } B;
        } CCR1;                /* Chan 1 Control Register */
        
        union {
    	    vuint32_t R;
            struct {
                vuint32_t :31;
                vuint32_t CIF:1;
        	} B;
        } CIR1;                /* Chan 1 Interrupt Register */
	
		    union {
    	    vuint32_t R;
        } CMP1;                /* Chan 1 Compare Register */

		    uint32_t STM_reserved3[1];
        
        /* channel 2 registers */
		    union {
            vuint32_t R;
            struct {
                vuint32_t :31;
             	vuint32_t CEN:1;   			
            } B;
        } CCR2;                /* Chan 2 Control Register */
        
        union {
    	    vuint32_t R;
            struct {
                vuint32_t :31;
                vuint32_t CIF:1;
        	} B;
        } CIR2;                /* Chan 2 Interrupt Register */
	
		    union {
    	    vuint32_t R;
        } CMP2;                /* Chan 2 Compare Register */

		    uint32_t STM_reserved4[1];

        /* channel 3 registers */
		    union {
            vuint32_t R;
            struct {
                vuint32_t :31;
             	vuint32_t CEN:1;   			
            } B;
        } CCR3;                /* Chan 3 Control Register */
        
        union {
    	    vuint32_t R;
            struct {
                vuint32_t :31;
                vuint32_t CIF:1;
        	} B;
        } CIR3;                /* Chan 3 Interrupt Register */
	
		    union {
    	    vuint32_t R;
        } CMP3;                /* Chan 3 Compare Register */
        
        uint32_t STM_reserved0050[4076];  /* 0x0050-0x3FFF */
    
    };

/****************************************************************************/
/*                     MODULE : ECSM                                        */
/****************************************************************************/

    struct ECSM_tag {
    
        union {                /* Processor core type */
            vuint16_t R;
        } PCT;
        
        union {                /* Platform revision */
            vuint16_t R;
        } REV;
        
        uint32_t ECSM_reserved0004;  /* 0x0004-0x0007 */
        
        union {                 /* IPS Module Configuration */
            vuint32_t R;
        } IMC;
        
        uint8_t ECSM_reserved000C[3];  /* 0x000C-0x000E */
        
        union {                 /* Miscellaneous Reset Status Register */
            vuint8_t R;
            struct {
                vuint8_t POR:1;
                vuint8_t DIR:1;
                vuint8_t SWTR:1;
                vuint8_t:5;
            } B;
        } MRSR;
        
