newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
        union {                  /* Global Write Register High */
            vuint32_t R;
            struct {
                vuint32_t GWEN63:1;
                vuint32_t GWEN62:1;
                vuint32_t GWEN61:1;
                vuint32_t GWEN60:1;
                vuint32_t GWEN59:1;
                vuint32_t GWEN58:1;
                vuint32_t GWEN57:1;
                vuint32_t GWEN56:1;
                vuint32_t GWEN55:1;
                vuint32_t GWEN54:1;
                vuint32_t GWEN53:1;
                vuint32_t GWEN52:1;
                vuint32_t GWEN51:1;
                vuint32_t GWEN50:1;
                vuint32_t GWEN49:1;
                vuint32_t GWEN48:1;
                vuint32_t GWEN47:1;
                vuint32_t GWEN46:1;
                vuint32_t GWEN45:1;
                vuint32_t GWEN44:1;
                vuint32_t GWEN43:1;
                vuint32_t GWEN42:1;
                vuint32_t GWEN41:1;
                vuint32_t GWEN40:1;
                vuint32_t GWEN39:1;
                vuint32_t GWEN38:1;
                vuint32_t GWEN37:1;
                vuint32_t GWEN36:1;
                vuint32_t GWEN35:1;
                vuint32_t GWEN34:1;
                vuint32_t GWEN33:1;
                vuint32_t GWEN32:1;
            } B;
        } GWRH;
        
        union {                  /* hardware request status low */
            vuint32_t R;
            struct {
                vuint32_t GWEN31:1;
                vuint32_t GWEN30:1;
                vuint32_t GWEN29:1;
                vuint32_t GWEN28:1;
                vuint32_t GWEN27:1;
                vuint32_t GWEN26:1;
                vuint32_t GWEN25:1;
                vuint32_t GWEN24:1;
                vuint32_t GWEN23:1;
                vuint32_t GWEN22:1;
                vuint32_t GWEN21:1;
                vuint32_t GWEN20:1;
                vuint32_t GWEN19:1;
                vuint32_t GWEN18:1;
                vuint32_t GWEN17:1;
                vuint32_t GWEN16:1;
                vuint32_t GWEN15:1;
                vuint32_t GWEN14:1;
                vuint32_t GWEN13:1;
                vuint32_t GWEN12:1;
                vuint32_t GWEN11:1;
                vuint32_t GWEN10:1;
                vuint32_t GWEN09:1;
                vuint32_t GWEN08:1;
                vuint32_t GWEN07:1;
                vuint32_t GWEN06:1;
                vuint32_t GWEN05:1;
                vuint32_t GWEN04:1;
                vuint32_t GWEN03:1;
                vuint32_t GWEN02:1;
                vuint32_t GWEN01:1;
                vuint32_t GWEN00:1;
            } B;
        } GWRL;
        
        uint32_t eDMA_reserved0040[48];  /* 0x0040-0x00FF */
        
        union {              /* Channel n Priority */
            vuint8_t R;
            struct {
                vuint8_t ECP:1;
                vuint8_t DPA:1;
                vuint8_t GRPPRI:2;
                vuint8_t CHPRI:4;
            } B;
        } CPR[64];
        
        uint32_t eDMA_reserved0140[944];  /* 0x0140-0x0FFF */

/****************************************************************************/
/*       DMA2 Transfer Control Descriptor                                   */
/****************************************************************************/

        struct tcd_t {          /* for "standard" format TCDs (when EDMA.TCD[x].CITER.E_LINK==BITER.E_LINK=0 && EDMA.EMLM=0 ) */
            /* 00 */
            vuint32_t SADDR;    /* Source Address */
            
            /* 04 */            /* Transfer Attributes */
            vuint16_t SMOD:5;   /* Source Address Modulo */
            vuint16_t SSIZE:3;  /* Source Data Transfer Size */
            vuint16_t DMOD:5;   /* Destination Address Modulo */
            vuint16_t DSIZE:3;  /* Destination Data Transfer Size */
            
            /* 06 */
            vint16_t SOFF;      /* Signed Source Address Offset */
            
            /* 08 */
            vuint32_t NBYTES;   /* Inner ("Minor") Byte Transfer Count */
            
            /* 0C */
            vint32_t SLAST;     /* Last Source Address Adjustment */
            
            /* 10 */
            vuint32_t DADDR;    /* Destination Address */
            
            /* 14 */
            vuint16_t CITERE_LINK:1;     /* Enable Channel-to-Channel        */
                                         /* Linking on Minor Loop Completion */
            vuint16_t CITER:15;          /* Current Major Iteration Count    */
            
            /* 16 */
            vint16_t DOFF;      /* Signed Destination Address Offset */
            
            /* 18 */
            vint32_t DLAST_SGA; /* Last Destination Address Adjustment, or  */
                                /* Scatter/Gather Address (if E_SG = 1)     */
            
            /* 1C */
            vuint16_t BITERE_LINK:1;    /* Enable Channel-to-Channel           */
                                        /* Linking on Minor Loop Complete      */
            vuint16_t BITER:15;         /* Starting ("Major") Iteration Count */
            
            /* 1E */                    /* Channel Control/Status */
            vuint16_t BWC:2;            /* Bandwidth Control */
            vuint16_t MAJORLINKCH:6;    /* Link Channel Number */
            vuint16_t DONE:1;           /* Channel Done */
#ifdef COMP_TO_MPC5634M_V1_6_ON
			vuint16_t ACT:1;
#else
			vuint16_t ACTIVE:1;
#endif
            vuint16_t MAJORE_LINK:1;    /* Enable Channel-to-Channel Link */
            vuint16_t E_SG:1;           /* Enable Scatter/Gather Descriptor */
            vuint16_t D_REQ:1;          /* Disable IPD_REQ When Done */
            vuint16_t INT_HALF:1;       /* Interrupt on CITER = (BITER >> 1) */
            vuint16_t INT_MAJ:1;        /* Interrupt on Major Loop Completion */
            vuint16_t START:1;          /* Explicit Channel Start */
        } TCD[64];                      /* Transfer_Control_Descriptor */
    
    };

    struct EDMA_TCD_alt1_tag {  /*for alternate format TCDs (when EDMA.TCD[x].CITER.E_LINK==BITER.E_LINK=1 ) */
    
