newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
        struct tcd_alt1_t {
            /* 00 */
            vuint32_t SADDR;    /* Source Address */
            
            /* 04 */            /* Transfer Attributes */
            vuint16_t SMOD:5;   /* Source Address Modulo */
            vuint16_t SSIZE:3;  /* Source Data Transfer Size */
            vuint16_t DMOD:5;   /* Destination Address Modulo */
            vuint16_t DSIZE:3;  /* Destination Data Transfer Size */
            
            /* 06 */
            vint16_t SOFF;      /* Signed Source Address Offset */
            
            /* 08 */
            vuint32_t NBYTES;   /* Inner ("Minor") Byte Transfer Count */
            
            /* 0C */
            vint32_t SLAST;     /* Last Source Address Adjustment */
            
            /* 10 */
            vuint32_t DADDR;    /* Destination Address */
            
            /* 14 */
            vuint16_t CITERE_LINK:1;     /* Enable Channel-to-Channel        */
                                         /* Linking on Minor Loop Completion */
            vuint16_t CITERLINKCH:6;     /* Link Channel Number              */
            vuint16_t CITER:9;           /* Current Major Iteration Count    */
            
            /* 16 */
            vint16_t DOFF;      /* Signed Destination Address Offset */
            
            /* 18 */
            vint32_t DLAST_SGA; /* Last Destination Address Adjustment, or  */
                                /* Scatter/Gather Address (if E_SG = 1)     */
            
            /* 1C */
            vuint16_t BITERE_LINK:1;    /* Enable Channel-to-Channel           */
                                        /* Linking on Minor Loop Complete      */
            vuint16_t BITERLINKCH:6;    /* Link Channel Number                 */
            vuint16_t BITER:9;          /* Starting ("Major") Iteration Count  */
            
            /* 1E */                    /* Channel Control/Status */
            vuint16_t BWC:2;            /* Bandwidth Control */
            vuint16_t MAJORLINKCH:6;    /* Link Channel Number */
            vuint16_t DONE:1;           /* Channel Done */
#ifdef COMP_TO_MPC5634M_V1_6_ON
			vuint16_t ACT:1;
#else
			vuint16_t ACTIVE:1;
#endif
            vuint16_t MAJORE_LINK:1;    /* Enable Channel-to-Channel Link */
            vuint16_t E_SG:1;           /* Enable Scatter/Gather Descriptor */
            vuint16_t D_REQ:1;          /* Disable IPD_REQ When Done */
            vuint16_t INT_HALF:1;       /* Interrupt on CITER = (BITER >> 1) */
            vuint16_t INT_MAJ:1;        /* Interrupt on Major Loop Completion */
            vuint16_t START:1;          /* Explicit Channel Start */
        } TCD[64];              /* transfer_control_descriptor */
    };


/* ----------------------------------------------------------------------------
   -- INTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INTC_Peripheral_Access_Layer INTC Peripheral Access Layer
 * @{
 */


/** INTC - Size of Registers Arrays */
#define INTC_SSCIR_COUNT                         8u
#define INTC_PSR_COUNT                           512u

/** INTC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< INTC Module Configuration Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t CPR0;                              /**< INTC Current Priority Register for Processor n, offset: 0x8 */
  __IO uint32_t CPR1;                              /**< INTC Current Priority Register for Processor n, offset: 0xC */
  __IO uint32_t IACKR0;                            /**< INTC Interrupt Acknowledge Register for Processor n, offset: 0x10 */
  __IO uint32_t IACKR1;                            /**< INTC Interrupt Acknowledge Register for Processor n, offset: 0x14 */
  __O  uint32_t EOIR0;                             /**< INTC End Of Interrupt Register for Processor n, offset: 0x18 */
  __O  uint32_t EOIR1;                             /**< INTC End Of Interrupt Register for Processor n, offset: 0x1C */
  __IO uint8_t SSCIR[INTC_SSCIR_COUNT];            /**< INTC Software Set/Clear Interrupt Register, array offset: 0x20, array step: 0x1 */
       uint8_t RESERVED_1[24];
  __IO uint8_t PSR[INTC_PSR_COUNT];                /**< INTC Priority Select Register, array offset: 0x40, array step: 0x1 */
} INTC_Type, *INTC_MemMapPtr;

 /** Number of instances of the INTC module. */
#define INTC_INSTANCE_COUNT                      (1u)


/* INTC - Peripheral instance base addresses */
/** Peripheral INTC base address */
#define INTC_BASE                                (0xFFF48000u)
/** Peripheral INTC base pointer */
#define INTC                                     ((INTC_Type *)INTC_BASE)
/** Array initializer of INTC peripheral base addresses */
#define INTC_BASE_ADDRS                          { INTC_BASE }
/** Array initializer of INTC peripheral base pointers */
#define INTC_BASE_PTRS                           { INTC }

/* ----------------------------------------------------------------------------
   -- INTC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INTC_Register_Masks INTC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define INTC_MCR_HVEN_PRC0_MASK                  0x1u
#define INTC_MCR_HVEN_PRC0_SHIFT                 0u
#define INTC_MCR_HVEN_PRC0_WIDTH                 1u
#define INTC_MCR_HVEN_PRC0(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_HVEN_PRC0_SHIFT))&INTC_MCR_HVEN_PRC0_MASK)
#define INTC_MCR_VTES_PRC0_MASK                  0x20u
#define INTC_MCR_VTES_PRC0_SHIFT                 5u
#define INTC_MCR_VTES_PRC0_WIDTH                 1u
#define INTC_MCR_VTES_PRC0(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_VTES_PRC0_SHIFT))&INTC_MCR_VTES_PRC0_MASK)
#define INTC_MCR_HVEN_PRC1_MASK                  0x100u
#define INTC_MCR_HVEN_PRC1_SHIFT                 8u
#define INTC_MCR_HVEN_PRC1_WIDTH                 1u
#define INTC_MCR_HVEN_PRC1(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_HVEN_PRC1_SHIFT))&INTC_MCR_HVEN_PRC1_MASK)
#define INTC_MCR_VTES_PRC1_MASK                  0x2000u
#define INTC_MCR_VTES_PRC1_SHIFT                 13u
#define INTC_MCR_VTES_PRC1_WIDTH                 1u
#define INTC_MCR_VTES_PRC1(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_VTES_PRC1_SHIFT))&INTC_MCR_VTES_PRC1_MASK)
/* CPR0 Bit Fields */
#define INTC_CPR0_PRI_MASK                       0xFu
#define INTC_CPR0_PRI_SHIFT                      0u
#define INTC_CPR0_PRI_WIDTH                      4u
#define INTC_CPR0_PRI(x)                         (((uint32_t)(((uint32_t)(x))<<INTC_CPR0_PRI_SHIFT))&INTC_CPR0_PRI_MASK)
/* CPR1 Bit Fields */
#define INTC_CPR1_PRI_MASK                       0xFu
#define INTC_CPR1_PRI_SHIFT                      0u
#define INTC_CPR1_PRI_WIDTH                      4u
#define INTC_CPR1_PRI(x)                         (((uint32_t)(((uint32_t)(x))<<INTC_CPR1_PRI_SHIFT))&INTC_CPR1_PRI_MASK)
/* IACKR0 Bit Fields */
#define INTC_IACKR0_INTVEC_PRCn_MASK             0x7FCu
#define INTC_IACKR0_INTVEC_PRCn_SHIFT            2u
#define INTC_IACKR0_INTVEC_PRCn_WIDTH            9u
#define INTC_IACKR0_INTVEC_PRCn(x)               (((uint32_t)(((uint32_t)(x))<<INTC_IACKR0_INTVEC_PRCn_SHIFT))&INTC_IACKR0_INTVEC_PRCn_MASK)
#define INTC_IACKR0_VTBA_PRCn_MASK               0xFFFFF800u
#define INTC_IACKR0_VTBA_PRCn_SHIFT              11u
#define INTC_IACKR0_VTBA_PRCn_WIDTH              21u
#define INTC_IACKR0_VTBA_PRCn(x)                 (((uint32_t)(((uint32_t)(x))<<INTC_IACKR0_VTBA_PRCn_SHIFT))&INTC_IACKR0_VTBA_PRCn_MASK)
/* IACKR1 Bit Fields */
#define INTC_IACKR1_INTVEC_PRCn_MASK             0x7FCu
#define INTC_IACKR1_INTVEC_PRCn_SHIFT            2u
#define INTC_IACKR1_INTVEC_PRCn_WIDTH            9u
#define INTC_IACKR1_INTVEC_PRCn(x)               (((uint32_t)(((uint32_t)(x))<<INTC_IACKR1_INTVEC_PRCn_SHIFT))&INTC_IACKR1_INTVEC_PRCn_MASK)
#define INTC_IACKR1_VTBA_PRCn_MASK               0xFFFFF800u
#define INTC_IACKR1_VTBA_PRCn_SHIFT              11u
#define INTC_IACKR1_VTBA_PRCn_WIDTH              21u
#define INTC_IACKR1_VTBA_PRCn(x)                 (((uint32_t)(((uint32_t)(x))<<INTC_IACKR1_VTBA_PRCn_SHIFT))&INTC_IACKR1_VTBA_PRCn_MASK)
/* EOIR0 Bit Fields */
#define INTC_EOIR0_EOI_PRCn_MASK                 0xFFFFFFFFu
#define INTC_EOIR0_EOI_PRCn_SHIFT                0u
#define INTC_EOIR0_EOI_PRCn_WIDTH                32u
#define INTC_EOIR0_EOI_PRCn(x)                   (((uint32_t)(((uint32_t)(x))<<INTC_EOIR0_EOI_PRCn_SHIFT))&INTC_EOIR0_EOI_PRCn_MASK)
/* EOIR1 Bit Fields */
#define INTC_EOIR1_EOI_PRCn_MASK                 0xFFFFFFFFu
#define INTC_EOIR1_EOI_PRCn_SHIFT                0u
#define INTC_EOIR1_EOI_PRCn_WIDTH                32u
#define INTC_EOIR1_EOI_PRCn(x)                   (((uint32_t)(((uint32_t)(x))<<INTC_EOIR1_EOI_PRCn_SHIFT))&INTC_EOIR1_EOI_PRCn_MASK)
/* SSCIR Bit Fields */
#define INTC_SSCIR_CLR_MASK                      0x1u
#define INTC_SSCIR_CLR_SHIFT                     0u
#define INTC_SSCIR_CLR_WIDTH                     1u
#define INTC_SSCIR_CLR(x)                        (((uint8_t)(((uint8_t)(x))<<INTC_SSCIR_CLR_SHIFT))&INTC_SSCIR_CLR_MASK)
#define INTC_SSCIR_SET_MASK                      0x2u
#define INTC_SSCIR_SET_SHIFT                     1u
#define INTC_SSCIR_SET_WIDTH                     1u
#define INTC_SSCIR_SET(x)                        (((uint8_t)(((uint8_t)(x))<<INTC_SSCIR_SET_SHIFT))&INTC_SSCIR_SET_MASK)
/* PSR Bit Fields */
#define INTC_PSR_PRIN_MASK                       0xFu
#define INTC_PSR_PRIN_SHIFT                      0u
#define INTC_PSR_PRIN_WIDTH                      4u
#define INTC_PSR_PRIN(x)                         (((uint8_t)(((uint8_t)(x))<<INTC_PSR_PRIN_SHIFT))&INTC_PSR_PRIN_MASK)
#define INTC_PSR_PRC_SELn_MASK                   0xC0u
#define INTC_PSR_PRC_SELn_SHIFT                  6u
#define INTC_PSR_PRC_SELn_WIDTH                  2u
#define INTC_PSR_PRC_SELn(x)                     (((uint8_t)(((uint8_t)(x))<<INTC_PSR_PRC_SELn_SHIFT))&INTC_PSR_PRC_SELn_MASK)

/*!
 * @}
 */ /* end of group INTC_Register_Masks */


/*!
 * @}
 */ /* end of group INTC_Peripheral_Access_Layer */

