newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
#define eSCI_LCR1_LIN_MASK                       0x100u
#define eSCI_LCR1_LIN_SHIFT                      8u
#define eSCI_LCR1_LIN_WIDTH                      1u
#define eSCI_LCR1_LIN(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_LIN_SHIFT))&eSCI_LCR1_LIN_MASK)
#define eSCI_LCR1_PRTY_MASK                      0x200u
#define eSCI_LCR1_PRTY_SHIFT                     9u
#define eSCI_LCR1_PRTY_WIDTH                     1u
#define eSCI_LCR1_PRTY(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_PRTY_SHIFT))&eSCI_LCR1_PRTY_MASK)
#define eSCI_LCR1_WUD_MASK                       0x3000u
#define eSCI_LCR1_WUD_SHIFT                      12u
#define eSCI_LCR1_WUD_WIDTH                      2u
#define eSCI_LCR1_WUD(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_WUD_SHIFT))&eSCI_LCR1_WUD_MASK)
#define eSCI_LCR1_WU_MASK                        0x4000u
#define eSCI_LCR1_WU_SHIFT                       14u
#define eSCI_LCR1_WU_WIDTH                       1u
#define eSCI_LCR1_WU(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_WU_SHIFT))&eSCI_LCR1_WU_MASK)
#define eSCI_LCR1_LRES_MASK                      0x8000u
#define eSCI_LCR1_LRES_SHIFT                     15u
#define eSCI_LCR1_LRES_WIDTH                     1u
#define eSCI_LCR1_LRES(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_LRES_SHIFT))&eSCI_LCR1_LRES_MASK)
/* LCR2 Bit Fields */
#define eSCI_LCR2_OFIE_MASK                      0x100u
#define eSCI_LCR2_OFIE_SHIFT                     8u
#define eSCI_LCR2_OFIE_WIDTH                     1u
#define eSCI_LCR2_OFIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR2_OFIE_SHIFT))&eSCI_LCR2_OFIE_MASK)
#define eSCI_LCR2_UQIE_MASK                      0x200u
#define eSCI_LCR2_UQIE_SHIFT                     9u
#define eSCI_LCR2_UQIE_WIDTH                     1u
#define eSCI_LCR2_UQIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR2_UQIE_SHIFT))&eSCI_LCR2_UQIE_MASK)
/* LTR Bit Fields */
#define eSCI_LTR_DATA_MASK                       0xFFu
#define eSCI_LTR_DATA_SHIFT                      0u
#define eSCI_LTR_DATA_WIDTH                      8u
#define eSCI_LTR_DATA(x)                         (((uint8_t)(((uint8_t)(x))<<eSCI_LTR_DATA_SHIFT))&eSCI_LTR_DATA_MASK)
/* LRR Bit Fields */
#define eSCI_LRR_D_MASK                          0xFFu
#define eSCI_LRR_D_SHIFT                         0u
#define eSCI_LRR_D_WIDTH                         8u
#define eSCI_LRR_D(x)                            (((uint8_t)(((uint8_t)(x))<<eSCI_LRR_D_SHIFT))&eSCI_LRR_D_MASK)
/* LPR Bit Fields */
#define eSCI_LPR_P_MASK                          0xFFFFu
#define eSCI_LPR_P_SHIFT                         0u
#define eSCI_LPR_P_WIDTH                         16u
#define eSCI_LPR_P(x)                            (((uint16_t)(((uint16_t)(x))<<eSCI_LPR_P_SHIFT))&eSCI_LPR_P_MASK)
/* CR3 Bit Fields */
#define eSCI_CR3_M2_MASK                         0x100u
#define eSCI_CR3_M2_SHIFT                        8u
#define eSCI_CR3_M2_WIDTH                        1u
#define eSCI_CR3_M2(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_M2_SHIFT))&eSCI_CR3_M2_MASK)
#define eSCI_CR3_ERPE_MASK                       0x200u
#define eSCI_CR3_ERPE_SHIFT                      9u
#define eSCI_CR3_ERPE_WIDTH                      1u
#define eSCI_CR3_ERPE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_ERPE_SHIFT))&eSCI_CR3_ERPE_MASK)
#define eSCI_CR3_ERFE_MASK                       0x400u
#define eSCI_CR3_ERFE_SHIFT                      10u
#define eSCI_CR3_ERFE_WIDTH                      1u
#define eSCI_CR3_ERFE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_ERFE_SHIFT))&eSCI_CR3_ERFE_MASK)
#define eSCI_CR3_EROE_MASK                       0x800u
#define eSCI_CR3_EROE_SHIFT                      11u
#define eSCI_CR3_EROE_WIDTH                      1u
#define eSCI_CR3_EROE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_EROE_SHIFT))&eSCI_CR3_EROE_MASK)

/*!
 * @}
 */ /* end of group eSCI_Register_Masks */


/*!
 * @}
 */ /* end of group eSCI_Peripheral_Access_Layer */


/****************************************************************************/
/*                          MODULE : FlexCAN                                */
/****************************************************************************/

/** CAN - Size of Registers Arrays */
#define CAN_RAMn_COUNT                           (256u)
#define CAN_RXIMR_COUNT                          64u

/** CAN - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t CTRL1;                             /**< Control 1 register, offset: 0x4 */
  __IO uint32_t TIMER;                             /**< Free Running Timer, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t RXMGMASK;                          /**< Rx Mailboxes Global Mask Register, offset: 0x10 */
  __IO uint32_t RX14MASK;                          /**< Rx 14 Mask register, offset: 0x14 */
  __IO uint32_t RX15MASK;                          /**< Rx 15 Mask register, offset: 0x18 */
  __IO uint32_t ECR;                               /**< Error Counter, offset: 0x1C */
  __IO uint32_t ESR1;                              /**< Error and Status 1 register, offset: 0x20 */
  __IO uint32_t IMASK2;                            /**< Interrupt Masks 2 register, offset: 0x24 */
  __IO uint32_t IMASK1;                            /**< Interrupt Masks 1 register, offset: 0x28 */
  __IO uint32_t IFLAG2;                            /**< Interrupt Flags 2 register, offset: 0x2C */
  __IO uint32_t IFLAG1;                            /**< Interrupt Flags 1 register, offset: 0x30 */
  __IO uint32_t CTRL2;                             /**< Control 2 register, offset: 0x34 */
       uint32_t RESERVED_1[18];
  __IO uint32_t RAMn[CAN_RAMn_COUNT];              /**< Embedded RAM, array offset: 0x60, array step: 0x4 */
       uint32_t RESERVED_2[256];
  __IO uint32_t RXIMR[CAN_RXIMR_COUNT];            /**< Rx Individual Mask Registers, array offset: 0x880, array step: 0x4 */
       uint8_t RESERVED_3[352];
       uint32_t RESERVED_4[96];
} CAN_Type, *CAN_MemMapPtr;
