newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
    typedef struct uMB_HEADER   /* message buffer header */
    {
        F_HEADER_t FRAME_HEADER;
        vuint16_t DATA_OFFSET;
        S_STATUS_t SLOT_STATUS;
    } MB_HEADER_t;

/****************************************************************************/
/*                          MODULE : DTS                                    */
/****************************************************************************/

    struct DTS_tag {
        union {
            vuint32_t R;
            struct {
                vuint32_t:31;        /*  */
                vuint32_t DTS_EN:1; /* Enable for the DTS Module */
            } B;
        } ENABLE;                /* DTS_ENABLE @baseaddress */

        union 
        {
        	vuint32_t R;
            struct {
                vuint32_t AD31:1;       /* Startup register MSB */
                vuint32_t AD30:1;       /* */
                vuint32_t AD29:1;       /* */
                vuint32_t AD28:1;       /* */
                vuint32_t AD27:1;       /* */
                vuint32_t AD26:1;       /* */
                vuint32_t AD25:1;       /* */
                vuint32_t AD24:1;       /* */
                vuint32_t AD23:1;       /* */
                vuint32_t AD22:1;       /* */
                vuint32_t AD21:1;       /* */
                vuint32_t AD20:1;       /* */
                vuint32_t AD19:1;       /* */
                vuint32_t AD18:1;       /* */
                vuint32_t AD17:1;       /* */
                vuint32_t AD16:1;       /* */
                vuint32_t AD15:1;       /* */
                vuint32_t AD14:1;       /* */
                vuint32_t AD13:1;       /* */
                vuint32_t AD12:1;       /* */
                vuint32_t AD11:1;       /* */
                vuint32_t AD10:1;       /* */
                vuint32_t AD9:1;       /* */
                vuint32_t AD8:1;       /* */
                vuint32_t AD7:1;       /* */
                vuint32_t AD6:1;       /* */
                vuint32_t AD5:1;       /* */
                vuint32_t AD4:1;       /* */
                vuint32_t AD3:1;       /* */
                vuint32_t AD2:1;       /* */
                vuint32_t AD1:1;       /* */
                vuint32_t AD0:1;       /* Startup Register LSB */
            } B;
        } STARTUP;                /* DTS_STARTUP @baseaddress + 0x4*/

        union 
        {
        	vuint32_t R;
            struct {
                vuint32_t ST31:1;       /* Semaphore register MSB */
                vuint32_t ST30:1;       /* */
                vuint32_t ST29:1;       /* */
                vuint32_t ST28:1;       /* */
                vuint32_t ST27:1;       /* */
                vuint32_t ST26:1;       /* */
                vuint32_t ST25:1;       /* */
                vuint32_t ST24:1;       /* */
                vuint32_t ST23:1;       /* */
                vuint32_t ST22:1;       /* */
                vuint32_t ST21:1;       /* */
                vuint32_t ST20:1;       /* */
                vuint32_t ST19:1;       /* */
                vuint32_t ST18:1;       /* */
                vuint32_t ST17:1;       /* */
                vuint32_t ST16:1;       /* */
                vuint32_t ST15:1;       /* */
                vuint32_t ST14:1;       /* */
                vuint32_t ST13:1;       /* */
                vuint32_t ST12:1;       /* */
                vuint32_t ST11:1;       /* */
                vuint32_t ST10:1;       /* */
                vuint32_t ST9:1;       /* */
                vuint32_t ST8:1;       /* */
                vuint32_t ST7:1;       /* */
                vuint32_t ST6:1;       /* */
                vuint32_t ST5:1;       /* */
                vuint32_t ST4:1;       /* */
                vuint32_t ST3:1;       /* */
                vuint32_t ST2:1;       /* */
                vuint32_t ST1:1;       /* */
                vuint32_t ST0:1;       /* Semaphore Register LSB */
            } B;
        } SEMAPHORE;                /* DTS_STEMAPHORE @BaseAddress + 0x8 */        
    }; /* End of DTS Module */

/****************************************************************************/
/*                          MODULE : CCU                                    */
/****************************************************************************/

    struct CCU_tag {
    
        union {                 /* CCU Configuration/Error Status Register */
            vuint32_t R;
            struct {
                vuint32_t CP1ERR:2;
                vuint32_t CP0ERR:2;
                vuint32_t SRSTFLAG:1;
                vuint32_t:1;
                vuint32_t CP1IDLE:1;
                vuint32_t CP0IDLE:1;
                vuint32_t:2;
                vuint32_t CP1IEN:1;
                vuint32_t CP0IEN:1;
                vuint32_t:4;
                vuint32_t M3WMEN:1;
                vuint32_t M2WMEN:1;
                vuint32_t M1WMEN:1;
                vuint32_t M0WMEN:1;
                vuint32_t:10;
                vuint32_t SRSTEN:1;
                vuint32_t ENB:1;
            } B;
        } CESR;
        
        uint32_t CCU_reserved0004[3]; /* 0x0004-0x000F */
        
        struct {
            union {             /* CCU Error Address Registers */
                vuint32_t R;
                struct {
                    vuint32_t EADDR:32;
                } B;
            } EAR;
            
            union {             /* CCU Error Detail Registers */
                vuint32_t R;
                struct {
                    vuint32_t EACD:16;
                    vuint32_t EPID:8;
                    vuint32_t EMN:4;
                    vuint32_t EATTR:3;
                    vuint32_t ERW:1;
                } B;
            } EDR;
            
            uint32_t CCU_CORE_reserved0008[2]; /* 0x0008-0x000F */
            
        } CORE[2];
        
        union {           /* CCU Interrupt Registers */
            vuint32_t R;
            struct {
                vuint32_t:30;
                vuint32_t OIF:1;
                vuint32_t EIF:1;
            } B;
        } IR[2];
        
        uint32_t CCU_reserved0038[4082];  /* 0x0038-0x3FFF */
    
