newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
    };

/* ----------------------------------------------------------------------------
   -- SEMA42 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMA42_Peripheral_Access_Layer SEMA42 Peripheral Access Layer
 * @{
 */


/** SEMA42 - Size of Registers Arrays */
#define SEMA42_GATE_COUNT                        16u
#define SEMA42_CPINE_COUNT                       2u
#define SEMA42_CPNTF_COUNT                       2u

/** SEMA42 - Register Layout Typedef */
typedef struct {
  __IO uint8_t GATE[SEMA42_GATE_COUNT];            /**< Semaphores Gate 0 Register..Semaphores Gate 15 Register, array offset: 0x0, array step: 0x1 */
       uint8_t RESERVED_0[48];
  struct {                                         /* offset: 0x40, array step: 0x8 */
    __IO uint16_t CPINE;                             /**< Semaphores Processor n IRQ Notification Enable, array offset: 0x40, array step: 0x8 */
         uint8_t RESERVED_0[6];
  } CPINE[SEMA42_CPINE_COUNT];
       uint8_t RESERVED_1[48];
  struct {                                         /* offset: 0x80, array step: 0x8 */
    __IO uint16_t CPNTF;                             /**< Semaphores Processor n IRQ Notification, array offset: 0x80, array step: 0x8 */
         uint8_t RESERVED_0[6];
  } CPNTF[SEMA42_CPNTF_COUNT];
       uint8_t RESERVED_2[112];
  union {                                          /* offset: 0x100 */
    __I  uint16_t R;                                 /**< Reset Gate Read, offset: 0x100 */
    __O  uint16_t W;                                 /**< Reset Gate Write, offset: 0x100 */
  } RSTGT;
       uint8_t RESERVED_3[2];
  __IO uint16_t RSTNTF;                            /**< Semaphores (Secure) Reset IRQ Notification, offset: 0x104 */
} SEMA42_Type, *SEMA42_MemMapPtr;

 /** Number of instances of the SEMA42 module. */
#define SEMA42_INSTANCE_COUNT                    (1u)


/* SEMA42 - Peripheral instance base addresses */
/** Peripheral SEMA42 base address */
#define SEMA42_BASE                              (0xFFF24000u)
/** Peripheral SEMA42 base pointer */
#define SEMA42                                   ((SEMA42_Type *)SEMA42_BASE)
/** Array initializer of SEMA42 peripheral base addresses */
#define SEMA42_BASE_ADDRS                        { SEMA42_BASE }
/** Array initializer of SEMA42 peripheral base pointers */
#define SEMA42_BASE_PTRS                         { SEMA42 }

/* ----------------------------------------------------------------------------
   -- SEMA42 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMA42_Register_Masks SEMA42 Register Masks
 * @{
 */

/* GATE Bit Fields */
#define SEMA42_GATE_GTFSM_MASK                   0x3u
#define SEMA42_GATE_GTFSM_SHIFT                  0u
#define SEMA42_GATE_GTFSM_WIDTH                  2u
#define SEMA42_GATE_GTFSM(x)                     (((uint8_t)(((uint8_t)(x))<<SEMA42_GATE_GTFSM_SHIFT))&SEMA42_GATE_GTFSM_MASK)
/* CPINE Bit Fields */
#define SEMA42_CPINE_INE15_MASK                  0x1u
#define SEMA42_CPINE_INE15_SHIFT                 0u
#define SEMA42_CPINE_INE15_WIDTH                 1u
#define SEMA42_CPINE_INE15(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE15_SHIFT))&SEMA42_CPINE_INE15_MASK)
#define SEMA42_CPINE_INE14_MASK                  0x2u
#define SEMA42_CPINE_INE14_SHIFT                 1u
#define SEMA42_CPINE_INE14_WIDTH                 1u
#define SEMA42_CPINE_INE14(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE14_SHIFT))&SEMA42_CPINE_INE14_MASK)
#define SEMA42_CPINE_INE13_MASK                  0x4u
#define SEMA42_CPINE_INE13_SHIFT                 2u
#define SEMA42_CPINE_INE13_WIDTH                 1u
#define SEMA42_CPINE_INE13(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE13_SHIFT))&SEMA42_CPINE_INE13_MASK)
#define SEMA42_CPINE_INE12_MASK                  0x8u
#define SEMA42_CPINE_INE12_SHIFT                 3u
#define SEMA42_CPINE_INE12_WIDTH                 1u
#define SEMA42_CPINE_INE12(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE12_SHIFT))&SEMA42_CPINE_INE12_MASK)
#define SEMA42_CPINE_INE11_MASK                  0x10u
#define SEMA42_CPINE_INE11_SHIFT                 4u
#define SEMA42_CPINE_INE11_WIDTH                 1u
#define SEMA42_CPINE_INE11(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE11_SHIFT))&SEMA42_CPINE_INE11_MASK)
#define SEMA42_CPINE_INE10_MASK                  0x20u
#define SEMA42_CPINE_INE10_SHIFT                 5u
#define SEMA42_CPINE_INE10_WIDTH                 1u
#define SEMA42_CPINE_INE10(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE10_SHIFT))&SEMA42_CPINE_INE10_MASK)
#define SEMA42_CPINE_INE9_MASK                   0x40u
#define SEMA42_CPINE_INE9_SHIFT                  6u
#define SEMA42_CPINE_INE9_WIDTH                  1u
#define SEMA42_CPINE_INE9(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE9_SHIFT))&SEMA42_CPINE_INE9_MASK)
#define SEMA42_CPINE_INE8_MASK                   0x80u
#define SEMA42_CPINE_INE8_SHIFT                  7u
#define SEMA42_CPINE_INE8_WIDTH                  1u
#define SEMA42_CPINE_INE8(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE8_SHIFT))&SEMA42_CPINE_INE8_MASK)
#define SEMA42_CPINE_INE7_MASK                   0x100u
#define SEMA42_CPINE_INE7_SHIFT                  8u
#define SEMA42_CPINE_INE7_WIDTH                  1u
#define SEMA42_CPINE_INE7(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE7_SHIFT))&SEMA42_CPINE_INE7_MASK)
#define SEMA42_CPINE_INE6_MASK                   0x200u
#define SEMA42_CPINE_INE6_SHIFT                  9u
#define SEMA42_CPINE_INE6_WIDTH                  1u
#define SEMA42_CPINE_INE6(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE6_SHIFT))&SEMA42_CPINE_INE6_MASK)
#define SEMA42_CPINE_INE5_MASK                   0x400u
#define SEMA42_CPINE_INE5_SHIFT                  10u
#define SEMA42_CPINE_INE5_WIDTH                  1u
#define SEMA42_CPINE_INE5(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE5_SHIFT))&SEMA42_CPINE_INE5_MASK)
#define SEMA42_CPINE_INE4_MASK                   0x800u
#define SEMA42_CPINE_INE4_SHIFT                  11u
#define SEMA42_CPINE_INE4_WIDTH                  1u
#define SEMA42_CPINE_INE4(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE4_SHIFT))&SEMA42_CPINE_INE4_MASK)
#define SEMA42_CPINE_INE3_MASK                   0x1000u
#define SEMA42_CPINE_INE3_SHIFT                  12u
#define SEMA42_CPINE_INE3_WIDTH                  1u
#define SEMA42_CPINE_INE3(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE3_SHIFT))&SEMA42_CPINE_INE3_MASK)
#define SEMA42_CPINE_INE2_MASK                   0x2000u
#define SEMA42_CPINE_INE2_SHIFT                  13u
#define SEMA42_CPINE_INE2_WIDTH                  1u
#define SEMA42_CPINE_INE2(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE2_SHIFT))&SEMA42_CPINE_INE2_MASK)
#define SEMA42_CPINE_INE1_MASK                   0x4000u
#define SEMA42_CPINE_INE1_SHIFT                  14u
#define SEMA42_CPINE_INE1_WIDTH                  1u
#define SEMA42_CPINE_INE1(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE1_SHIFT))&SEMA42_CPINE_INE1_MASK)
#define SEMA42_CPINE_INE0_MASK                   0x8000u
#define SEMA42_CPINE_INE0_SHIFT                  15u
#define SEMA42_CPINE_INE0_WIDTH                  1u
#define SEMA42_CPINE_INE0(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE0_SHIFT))&SEMA42_CPINE_INE0_MASK)
/* CPNTF Bit Fields */
#define SEMA42_CPNTF_GNn_MASK                    0xFFFFu
#define SEMA42_CPNTF_GNn_SHIFT                   0u
#define SEMA42_CPNTF_GNn_WIDTH                   16u
#define SEMA42_CPNTF_GNn(x)                      (((uint16_t)(((uint16_t)(x))<<SEMA42_CPNTF_GNn_SHIFT))&SEMA42_CPNTF_GNn_MASK)
/* RSTGT_R Bit Fields */
#define SEMA42_RSTGT_R_RSTGTN_MASK               0xFFu
#define SEMA42_RSTGT_R_RSTGTN_SHIFT              0u
#define SEMA42_RSTGT_R_RSTGTN_WIDTH              8u
#define SEMA42_RSTGT_R_RSTGTN(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_R_RSTGTN_SHIFT))&SEMA42_RSTGT_R_RSTGTN_MASK)
#define SEMA42_RSTGT_R_RSTGMS_MASK               0x700u
#define SEMA42_RSTGT_R_RSTGMS_SHIFT              8u
#define SEMA42_RSTGT_R_RSTGMS_WIDTH              3u
#define SEMA42_RSTGT_R_RSTGMS(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_R_RSTGMS_SHIFT))&SEMA42_RSTGT_R_RSTGMS_MASK)
#define SEMA42_RSTGT_R_RSTGSM_MASK               0x3000u
#define SEMA42_RSTGT_R_RSTGSM_SHIFT              12u
#define SEMA42_RSTGT_R_RSTGSM_WIDTH              2u
#define SEMA42_RSTGT_R_RSTGSM(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_R_RSTGSM_SHIFT))&SEMA42_RSTGT_R_RSTGSM_MASK)
/* RSTGT_W Bit Fields */
#define SEMA42_RSTGT_W_RSTGTN_MASK               0xFFu
#define SEMA42_RSTGT_W_RSTGTN_SHIFT              0u
#define SEMA42_RSTGT_W_RSTGTN_WIDTH              8u
#define SEMA42_RSTGT_W_RSTGTN(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_W_RSTGTN_SHIFT))&SEMA42_RSTGT_W_RSTGTN_MASK)
#define SEMA42_RSTGT_W_RSTGDP_MASK               0xFF00u
#define SEMA42_RSTGT_W_RSTGDP_SHIFT              8u
#define SEMA42_RSTGT_W_RSTGDP_WIDTH              8u
#define SEMA42_RSTGT_W_RSTGDP(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_W_RSTGDP_SHIFT))&SEMA42_RSTGT_W_RSTGDP_MASK)
/* RSTNTF Bit Fields */
#define SEMA42_RSTNTF_RSTNTN_MASK                0xFFu
#define SEMA42_RSTNTF_RSTNTN_SHIFT               0u
#define SEMA42_RSTNTF_RSTNTN_WIDTH               8u
#define SEMA42_RSTNTF_RSTNTN(x)                  (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTNTF_RSTNTN_SHIFT))&SEMA42_RSTNTF_RSTNTN_MASK)
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_MASK  0xFF00u
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_SHIFT 8u
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_WIDTH 8u
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP(x)    (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_SHIFT))&SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_MASK)

/*!
 * @}
 */ /* end of group SEMA42_Register_Masks */


/*!
 * @}
 */ /* end of group SEMA42_Peripheral_Access_Layer */


