newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
/****************************************************************************/
/*                          MODULE : CRC                                    */
/****************************************************************************/
struct CRC_SUB_tag {
    union {
        vuint32_t R;      /* CRC Configuration Register */
        struct {
            vuint32_t:29;
            vuint32_t POLYG:1;
            vuint32_t SWAP:1;
            vuint32_t INV:1;
        } B;
    } CRC_CFG;

    union {               /* CRC Input Register */
        vuint8_t BYTE[4];       /* Data buffer in Bytes (8 bits) */
        vuint16_t HALFWORD[2];  /* Data buffer in Half-words (16 bits) */
        vuint32_t WORD;         /* Data buffer in words (32 bits) */
        vuint32_t R;            /* Data buffer in words (32 bits) */
    } CRC_INP;

    union {               /*CRC Current Status Register */
        vuint8_t BYTE[4];       /* Data buffer in Bytes (8 bits) */
        vuint16_t HALFWORD[2];  /* Data buffer in Half-words (16 bits) */
        vuint32_t WORD;         /* Data buffer in words (32 bits) */
        vuint32_t R;            /* Data buffer in words (32 bits) */
    } CRC_CSTAT;

    union {                /* CRC Output Register */
        vuint8_t BYTE[4];       /* Data buffer in Bytes (8 bits) */
        vuint16_t HALFWORD[2];  /* Data buffer in Half-words (16 bits) */
        vuint32_t WORD;         /* Data buffer in words (32 bits) */
        vuint32_t R;            /* Data buffer in words (32 bits) */
    } CRC_OUTP;
}; /* end of CRC_SUB_tag */

struct CRC_tag {
    struct CRC_SUB_tag CNTX[3];
}; /* end of CRC_tag */

/****************************************************************************/
/*                          MODULE : STCU                                   */
/****************************************************************************/
struct STCU_tag {
    union {
        vuint32_t R;      /* STCU Control Register */
        struct {
            vuint32_t:1;
            vuint32_t LBE:1;
            vuint32_t:2;
            vuint32_t FLF:2;
            vuint32_t:1;
            vuint32_t FCF:1;
            vuint32_t LBIST_CLK_DIV:2;
            vuint32_t:5;
            vuint32_t SOFT_RESET:1;
            vuint32_t:7;
            vuint32_t IE:1;
            vuint32_t:8;
        } B;
    } CTRL;

    union {
        vuint32_t R;      /* STCU Enable Register */
        struct {
            vuint32_t:15;
            vuint32_t STCU_ABORT:1;
            vuint32_t:15;
            vuint32_t STCU_START:1;
        } B;
    } ENABLE;

    union {
        vuint32_t R;      /* STCU Status Register */
        struct {
            vuint32_t:5;
            vuint32_t STCUR:1;
            vuint32_t LBISTR:1;
            vuint32_t:2;
            vuint32_t DNE:1;
            vuint32_t LDNE:1;
            vuint32_t:6;
            vuint32_t ABORT:1;
            vuint32_t LOCK:1;
            vuint32_t INIT_SEQ:2;
            vuint32_t WDE:2;
            vuint32_t:1;
            vuint32_t CRC_RESULT:8;
        } B;
    } STAT;

    union {
        vuint32_t R;      /* STCU Watchdog Timer */
    } WDGT;

    vuint32_t STCU_reserved0010; /* 0x0010-0x0013 */

    union {
        vuint32_t R;      /* STCU Unlock Key */
        struct {
            vuint32_t STCU_KEY:32;
        } B;
    } KEY;

    union {
        vuint32_t R;      /* LBIST Control Register */
        struct {
            vuint32_t:1;
            vuint32_t WINDOW_SIZE:3;
            vuint32_t:1;
            vuint32_t PFT:1;
            vuint32_t DM:1;
            vuint32_t SCM:1;
            vuint32_t SCAN_ENABLE_ON:4;
            vuint32_t SCAN_ENABLE_OFF:4;
            vuint32_t:5;
            vuint32_t SHIFT_SPEED:3;
            vuint32_t:3;
            vuint32_t LSER:1;
            vuint32_t:3;
            vuint32_t DEBUG:1;
        } B;
    } LBIST_CTRL;

    union {
        vuint32_t R;      /* LBIST Pattern Counter Start Register */
    } LBIST_PC_START;

    union {
        vuint32_t R;      /* LBIST Pattern Counter End Register */
    } LBIST_PC_END;

    union {
        vuint32_t R;      /* LBIST Pseudo-Random Number High */
    } LBIST_PRPGH;

    union {
        vuint32_t R;      /* LBIST Pseudo-Random Number Low */
    } LBIST_PRPGL;

    union {
        vuint32_t R;      /* LBIST Enable Register */
        struct {
            vuint32_t:30;
            vuint32_t LBE1:1;
            vuint32_t LBE0:1;
        } B;
    } LBIST_ENABLE;

    union {
        vuint32_t R;      /* LBIST Status Register */
        struct {
            vuint32_t:14;
            vuint32_t LBD1:1;
            vuint32_t LBD0:1;
            vuint32_t:16;
        } B;
    } LBIST_STATUS;

    vuint32_t STCU_reserved0034[7]; /* 0x0034-0x004F */

    union {
        vuint32_t R;      /* STCU Interrupt Enable/Status Register */
        struct {
            vuint32_t:31;
            vuint32_t IFLAG:1;
        } B;
    } INTERRUPT;

    union {
        vuint32_t R;      /* STCU Current Watchdog Timer */
    } CURRENT_WDGT;

    vuint32_t STCU_reserved0058[10]; /* 0x0058-0x007F */

    union {
        vuint32_t R;      /* LBIST 0 MISRH Register */
    } LBIST_MISRH0;

    union {
        vuint32_t R;      /* LBIST 0 MISRL Register */
    } LBIST_MISRL0;

    union {
        vuint32_t R;      /* LBIST 1 MISRH Register */
    } LBIST_MISRH1;

    union {
        vuint32_t R;      /* LBIST 1 MISRL Register */
    } LBIST_MISRL1;

}; /* end of STCU_tag */

/****************************************************************************/
/* Define memories */

#define SRAM_START    0x40000000
#define SRAM_SIZE        0x60000
#define SRAM_END      0x4005FFFF

#define FLASH_START   0x00000000
#define FLASH_SIZE      0x600000
#define FLASH_END     0x005FFFFF

/* Define instances of modules */
#define ETPU_C      (*( struct ETPU_C_tag *)     0xC3E20000)
#define ETPU_C_DATA_RAM      (*( uint32_t *)              0xC3E28000)
#define ETPU_C_DATA_RAM_END                               0xC3E28BFC 
#define ETPU_C_DATA_RAM_EXT  (*( uint32_t *)              0xC3E2C000)
#define C_CODE_RAM           (*( uint32_t *)              0xC3E30000)
#define ETPU_C_CODE_RAM      (*( uint32_t *)              0xC3E30000)

#define FMPLL     (*( struct FMPLL_tag *)      0xC3F80000)
#define EBI       (*( struct EBI_tag *)        0xC3F84000)
#define FLASH_A   (*( struct FLASH_tag *)      0xC3F88000)
#define FLASH_B   (*( struct FLASH_tag *)      0xC3F8C000)
#define DTS       (*( struct DTS_tag *)        0xC3F9C000)

#define EMIOS     (*( struct EMIOS_tag *)      0xC3FA0000)
#define PMC       (*( struct PMC_tag *)        0xC3FBC000)

#define ETPU         (*( struct ETPU_tag *)       0xC3FC0000)
#define ETPU_AB      (*( struct ETPU_tag *)       0xC3FC0000)
#define ETPU_DATA_RAM         (*( uint32_t *)              0xC3FC8000)
#define ETPU_AB_DATA_RAM      (*( uint32_t *)              0xC3FC8000)
#define ETPU_DATA_RAM_END                                  0xC3FC97FC 
#define ETPU_AB_DATA_RAM_END                               0xC3FC97FC 
#define ETPU_DATA_RAM_EXT     (*( uint32_t *)              0xC3FCC000)
#define ETPU_AB_DATA_RAM_EXT  (*( uint32_t *)              0xC3FCC000)
#define CODE_RAM              (*( uint32_t *)              0xC3FD0000)
#define AB_CODE_RAM           (*( uint32_t *)              0xC3FD0000)
#define ETPU_CODE_RAM         (*( uint32_t *)              0xC3FD0000)
#define ETPU_AB_CODE_RAM      (*( uint32_t *)              0xC3FD0000)

#define STCU      (*( struct STCU_tag *)       0xC3FF4000)

#define CRC       (*( struct CRC_tag *)        0xFFE68000)

#define XBAR      (*( struct XBAR_tag *)       0xFFF04000)
#define MPU       (*( struct MPU_tag *)        0xFFF10000)
#define SWT_B     (*( struct SWT_tag *)        0xFFF34000)
#define SWT       (*( struct SWT_tag *)        0xFFF38000)
#define SWT_A     (*( struct SWT_tag *)        0xFFF38000)
#define STM       (*( struct STM_tag *)        0xFFF3C000)
#define ECSM      (*( struct ECSM_tag *)       0xFFF40000)
#define EDMA EDMA_A
#define EDMA_A    (*( struct EDMA_tag *)       0xFFF44000)
#define CCU       (*( struct CCU_tag *)        0xFFF50000)
#define EDMA_B    (*( struct EDMA_tag *)       0xFFF54000)

#define EQADC EQADC_A
#define EQADC_A   (*( struct EQADC_tag *)      0xFFF80000)
#define EQADC_B   (*( struct EQADC_tag *)      0xFFF84000)

