newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
#define DECFIL_A   (*( struct DECFIL_tag *)      0xFFF88000)
#define DECFIL_B   (*( struct DECFIL_tag *)      0xFFF88800)
#define DECFIL_C   (*( struct DECFIL_tag *)      0xFFF89000)
#define DECFIL_D   (*( struct DECFIL_tag *)      0xFFF89800)
#define DECFIL_E   (*( struct DECFIL_tag *)      0xFFF8A000)
#define DECFIL_F   (*( struct DECFIL_tag *)      0xFFF8A800)
#define DECFIL_G   (*( struct DECFIL_tag *)      0xFFF8B000)
#define DECFIL_H   (*( struct DECFIL_tag *)      0xFFF8B800)
#define DECFIL_I   (*( struct DECFIL_tag *)      0xFFF8C000)
#define DECFIL_J   (*( struct DECFIL_tag *)      0xFFF8C800)
#define DECFIL_K   (*( struct DECFIL_tag *)      0xFFF8D000)
#define DECFIL_L   (*( struct DECFIL_tag *)      0xFFF8D800)

#define DSPI_A    (*( struct DSPI_tag *)       0xFFF90000)
#define DSPI_B    (*( struct DSPI_tag *)       0xFFF94000)
#define DSPI_C    (*( struct DSPI_tag *)       0xFFF98000)
#define DSPI_D    (*( struct DSPI_tag *)       0xFFF9C000)
#define DSPI_E    (*( struct DSPI_tag *)       0xFFFA0000)

/*-------------------- FLEXCAN -------------------------*/

#define CAN_INSTANCE_COUNT                       (4u)
/* CAN - Peripheral instance base addresses */
/** Peripheral CAN_0 base address */
#define CAN_0_BASE                               (0xFFFC0000u)
/** Peripheral CAN_0 base pointer */
#define CAN_0                                    ((CAN_Type *)CAN_0_BASE)
/** Peripheral CAN_1 base address */
#define CAN_1_BASE                               (0xFFFC4000u)
/** Peripheral CAN_1 base pointer */
#define CAN_1                                    ((CAN_Type *)CAN_1_BASE)
/** Peripheral CAN_2 base address */
#define CAN_2_BASE                               (0xC3E60000u)
/** Peripheral CAN_2 base pointer */
#define CAN_2                                    ((CAN_Type *)CAN_2_BASE)
/** Peripheral CAN_3 base address */
#define CAN_3_BASE                               (0xC3E64000u)
/** Peripheral CAN_3 base pointer */
#define CAN_3                                    ((CAN_Type *)CAN_3_BASE)
/** Array initializer of CAN peripheral base addresses */
#define CAN_BASE_ADDRS                           { CAN_0_BASE, CAN_1_BASE, CAN_2_BASE, CAN_3_BASE }
/** Array initializer of CAN peripheral base pointers */
#define CAN_BASE_PTRS                            { CAN_0, CAN_1, CAN_2, CAN_3 }

/** Interrupt vectors for the CAN peripheral type */
#define CAN_Rx_Warning_IRQS                      { CAN0_ESR1_IRQn, CAN1_ESR1_IRQn,\
                                                   CAN2_ESR1_IRQn, CAN3_ESR1_IRQn }

#define CAN_Tx_Warning_IRQS                      { CAN0_ESR1_IRQn, CAN1_ESR1_IRQn,\
                                                   CAN2_ESR1_IRQn, CAN3_ESR1_IRQn }

#define CAN_Error_IRQS                           { CAN0_ESR2_IRQn, CAN1_ESR2_IRQn,\
                                                   CAN2_ESR2_IRQn, CAN3_ESR2_IRQn }

#define CAN_Bus_Off_IRQS                         { CAN0_ESR1_IRQn, CAN1_ESR1_IRQn,\
                                                   CAN2_ESR1_IRQn, CAN3_ESR1_IRQn }

#define CAN_ORed_00_MB_IRQS                   { CAN0_BUF0_IRQn, \
                                                CAN1_BUF0_IRQn, \
                                                CAN2_BUF0_IRQn, \
                                                CAN3_BUF0_IRQn  }

#define CAN_ORed_01_MB_IRQS                   { CAN0_BUF1_IRQn, \
                                                CAN1_BUF1_IRQn, \
                                                CAN2_BUF1_IRQn, \
                                                CAN3_BUF1_IRQn  }

#define CAN_ORed_02_MB_IRQS                   { CAN0_BUF2_IRQn, \
                                                CAN1_BUF2_IRQn, \
                                                CAN2_BUF2_IRQn, \
                                                CAN3_BUF2_IRQn  }

#define CAN_ORed_03_MB_IRQS                   { CAN0_BUF3_IRQn, \
                                                CAN1_BUF3_IRQn, \
                                                CAN2_BUF3_IRQn, \
                                                CAN3_BUF3_IRQn  }

#define CAN_ORed_04_MB_IRQS                   { CAN0_BUF4_IRQn, \
                                                CAN1_BUF4_IRQn, \
                                                CAN2_BUF4_IRQn, \
                                                CAN3_BUF4_IRQn  }

#define CAN_ORed_05_MB_IRQS                   { CAN0_BUF5_IRQn, \
                                                CAN1_BUF5_IRQn, \
                                                CAN2_BUF5_IRQn, \
                                                CAN3_BUF5_IRQn  }

#define CAN_ORed_06_MB_IRQS                   { CAN0_BUF6_IRQn, \
                                                CAN1_BUF6_IRQn, \
                                                CAN2_BUF6_IRQn, \
                                                CAN3_BUF6_IRQn  }

#define CAN_ORed_07_MB_IRQS                   { CAN0_BUF7_IRQn, \
                                                CAN1_BUF7_IRQn, \
                                                CAN2_BUF7_IRQn, \
                                                CAN3_BUF7_IRQn  }

#define CAN_ORed_08_MB_IRQS                   { CAN0_BUF8_IRQn, \
                                                CAN1_BUF8_IRQn, \
                                                CAN2_BUF8_IRQn, \
                                                CAN3_BUF8_IRQn  }

#define CAN_ORed_09_MB_IRQS                   { CAN0_BUF9_IRQn, \
                                                CAN1_BUF9_IRQn, \
                                                CAN2_BUF9_IRQn, \
                                                CAN3_BUF9_IRQn  }

#define CAN_ORed_10_MB_IRQS                   { CAN0_BUF10_IRQn, \
                                                CAN1_BUF10_IRQn, \
                                                CAN2_BUF10_IRQn, \
                                                CAN3_BUF10_IRQn  }

#define CAN_ORed_11_MB_IRQS                   { CAN0_BUF11_IRQn, \
                                                CAN1_BUF11_IRQn, \
                                                CAN2_BUF11_IRQn, \
                                                CAN3_BUF11_IRQn  }

