newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R.h
#define CAN_ORed_12_MB_IRQS                   { CAN0_BUF12_IRQn, \
                                                CAN1_BUF12_IRQn, \
                                                CAN2_BUF12_IRQn, \
                                                CAN3_BUF12_IRQn  }

#define CAN_ORed_13_MB_IRQS                   { CAN0_BUF13_IRQn, \
                                                CAN1_BUF13_IRQn, \
                                                CAN2_BUF13_IRQn, \
                                                CAN3_BUF13_IRQn  }

#define CAN_ORed_14_MB_IRQS                   { CAN0_BUF14_IRQn, \
                                                CAN1_BUF14_IRQn, \
                                                CAN2_BUF14_IRQn, \
                                                CAN3_BUF14_IRQn  }

#define CAN_ORed_15_MB_IRQS                   { CAN0_BUF15_IRQn, \
                                                CAN1_BUF15_IRQn, \
                                                CAN2_BUF15_IRQn, \
                                                CAN3_BUF15_IRQn  }

#define CAN_ORed_16_31_MB_IRQS                   { CAN0_BUF16_31_IRQn, \
                                                   CAN1_BUF16_31_IRQn, \
                                                   CAN2_BUF16_31_IRQn, \
                                                   CAN3_BUF16_31_IRQn  }

#define CAN_ORed_32_63_MB_IRQS                   { CAN0_BUF32_63_IRQn, \
                                                   CAN1_BUF32_63_IRQn, \
                                                   CAN2_BUF32_63_IRQn, \
                                                   CAN3_BUF32_63_IRQn  }




#define FR        (*( struct FR_tag *)        0xFFFE0000)
#define TSENS     (*( struct TSENS_tag *)     0xFFFEC000)

#ifdef __MWERKS__
#pragma pop
#endif

#ifdef  __cplusplus
}
#endif
#endif                          /* ifdef _MPC567xR_H */
/*********************************************************************
 *
 * Copyright:
 *  Freescale Semiconductor, INC. All Rights Reserved.
 *  You are hereby granted a copyright license to use, modify, and
 *  distribute the SOFTWARE so long as this entire notice is
 *  retained without alteration in any modified and/or redistributed
 *  versions, and that such modified versions are clearly identified
 *  as such. No licenses are granted by implication, estoppel or
 *  otherwise under any patents or trademarks of Freescale
 *  Semiconductor, Inc. This software is provided on an "AS IS"
 *  basis and without warranty.
 *
 *  To the maximum extent permitted by applicable law, Freescale
 *  Semiconductor DISCLAIMS ALL WARRANTIES WHETHER EXPRESS OR IMPLIED,
 *  INCLUDING IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A
 *  PARTICULAR PURPOSE AND ANY WARRANTY AGAINST INFRINGEMENT WITH
 *  REGARD TO THE SOFTWARE (INCLUDING ANY MODIFIED VERSIONS THEREOF)
 *  AND ANY ACCOMPANYING WRITTEN MATERIALS.
 *
 *  To the maximum extent permitted by applicable law, IN NO EVENT
 *  SHALL Freescale Semiconductor BE LIABLE FOR ANY DAMAGES WHATSOEVER
 *  (INCLUDING WITHOUT LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS,
 *  BUSINESS INTERRUPTION, LOSS OF BUSINESS INFORMATION, OR OTHER
 *  PECUNIARY LOSS) ARISING OF THE USE OR INABILITY TO USE THE SOFTWARE.
 *
 *  Freescale Semiconductor assumes no responsibility for the
 *  maintenance and support of this software
 *
 ********************************************************************/
